{"serial": "33074", "code": "ME6092", "class": "*", "name": {"en": "Seminar II", "ch": "專題討論Ⅱ"}, "instructor": {"en": "Lee, Tien-Hsi", "ch": "李天錫"}, "department": {"en": "Department of Mechanical Engineering", "ch": "機械工程學系"}, "system": {"en": "Master/Doctoral Programme", "ch": "碩博同修"}, "time_loc": {"en": [{"time": {"week": 2, "period": ["7"]}, "loc": "Mechanical Engineering Building 101"}, {"time": {"week": 2, "period": ["8"]}, "loc": "Mechanical Engineering Building 101"}], "ch": [{"time": {"week": 2, "period": ["7"]}, "loc": "機械館", "room": "101"}, {"time": {"week": 2, "period": ["8"]}, "loc": "機械館", "room": "101"}]}, "required": true, "credits": "0", "isFulSem": false, "lang": {"en": "Chinese", "ch": "國語"}, "crsCard": {"en": "Optional", "ch": "部份使用"}, "max_stu": -1, "assigned": 0, "selected": 127, "remark": {"en": "", "ch": ""}, "goal": {"en": "For mechanical engineering knowledge and applications, this course invites experts and scholars from industry, academia, and research to share their knowledge, technology, and experience in the form of lectures, followed by discussions. This allows students to fully interact with these experts and scholars. The purpose is to provide opportunities for students to expand their knowledge horizons, find their own interests, experience the demeanor of experts, and thereby strengthen their self-confidence.", "ch": "針對機械工程知識與應用，本課程邀請來自產學研之專家學者以演講形式分享知識、科技與經驗，並於會後進行討論，讓學生與專家學者能夠充分交流。目的是提供機會讓學生拓展知識視野，尋找自我興趣，感受專家風範，進而強化學生自信。"}, "content": {"en": "Basic Principles:\n(a) For this semester, the minimum attendance requirement is 70％ of the total number of regular sessions (rounded up unconditionally). The regular session time for the special topic seminar is every Tuesday from 15:00 to 16:50. For regular session schedules, please refer to the Mechanical Engineering Department website or the physical bulletin board announcement.\n(b) For non-regular sessions, students may choose to attend the following lectures marked as “Eligible for Special Topic Discussion“, such as:\nSpecial topic lectures organized by the Department of Mechanical Engineering (sign-in required).\nSpecial topic lectures organized by the Departments of Material Science, Optomechatronics, Energy, or other departments (requires approval and signature from the supervising professor on the reflection report).\nLaboratory safety and health training for new students and the subsequent reflection report (can add up to 2 extra points).\nOther types of lectures (such as seminars), subject to approval by the supervising professor and the course instructor.\nOther: Other situations will be announced and handled by the course instructor as per the circumstances, such as pandemics, natural disasters, or other immediate crises.\nCourse Regulations:\nFor regular sessions, please sit according to the seating chart in the classroom. Teaching assistants will take attendance by taking photos 10 minutes after the class starts, and random checks/photos may be taken during the class. This course prohibits lateness and leaving early. Without a special reason, being more than 10 minutes late will be counted as an absence.\nFor non-regular sessions, please sign in personally at the entrance of the lecture venue. The teaching assistants will use the sign-in sheet for attendance.\nDuring the class, students must listen attentively to the oral reports and write a one-page (A4) reflection report on the spot, and submit the electronic file of the reflection report to the course assignment section “on the day of the lecture“. The report should include the lecture topic, the name of the speaker, a summary of the lecture content, personal reflections, and questions asked. (At least half a page).", "ch": "基本原則：\n(a)本學期必須至少出席次數為常規時間總場次之70％(無條件進位)。專題研討的常規時間為每週二 15：00～16：50。常規場次請參見機械系網頁或實體布告欄公告。\n(b)非常規時間得選擇參加下列有註明「可抵專題討論」之相關演講，例如：\n* 機械所舉辦之專題演講 (須簽到)。\n*材料所、光機電、能源或其他系所舉辦之專題演講 (須獲得指導教授同意並簽名於心得報告單)。\n*實驗室新生安全衛生教育訓練及參加後的心得報告（可加總分2分)。\n*其餘類型演講(如研討會等)，由指導教授與授課教師討論後決定是否認可。\n其他：其他情事另依照狀況由授課教師公告與辦理，例如疫情、天災、有立即危急。\n課程規定：\n1. 常規場次請按照教室座位表入座。助教會在上課後10分鐘拍照點名，上課過程視情況隨機抽點/拍照。本課程禁止遲到、早退。如無特殊之理由，遲到10 分鐘以上者將以未出席論。\n2. 非常規場次請於演講場地之入口處親自簽名。助教將依據簽名單作為點名依據。\n3. 同學上課時需專心聆聽口頭報告並於現場撰寫一頁（A4）心得報告單後，將心得報告單拍照後，現場繳交給助教，並於「演講當天」上傳電子檔至ee-class課程作業區內。報告內容需包括演講主題、演講者姓名、演講內容摘要、心得感想與發問的問題。(至少半頁)"}, "textbook": {"en": "Materials provided by the expert scholars giving the lectures.", "ch": "由專家學者提供資料"}, "self_comp": {"en": "100", "ch": "100"}, "method": {"en": "Seminar", "ch": "研討"}, "grading": {"en": "According to the aforementioned attendance rules, if the reflection reports are also qualified, a base score of 78 points is awarded. For each additional attendance, 3 points are added, with a maximum total of 95 points. The content of the reflection reports is also considered in the instructor‘s grading. If the attendance/submission ratio does not meet the requirements, scoring will be based on this ratio. Direct failure in the course or a noticeably poor quality of reflection reports will result from missing more than three sessions. To encourage active participation, asking questions during the class will add 2 points each time, with a maximum total of 95 points (exceptionally outstanding performance may exceed 95 points). Students who ask questions should register with the teaching assistant on the day of the lecture for the extra points. Failure to notify on the same day will be considered a forfeiture of the points. If you need to leave the lecture due to an emergency, you must report to the presiding teacher (or responsible teaching assistant) before leaving. The instructor will decide whether to consider it as attendance based on the situation. If the teaching assistant finds someone absent during a random check (photo) despite having signed in, that session will be counted as an absence and 20 points will be deducted from the total score. To respect the speaker and maintain order, disruptive behaviors such as making noise, using mobile phones, sleeping, or eating during the lecture are not allowed. Accumulating such behaviors more than twice (inclusive) in a semester will result in a failing grade. If there are concerns about the grades, please confirm with the teaching assistant. No objections to the semester grades will be entertained three days after their announcement.", "ch": "1. 按上述規定出席次數，心得單內容亦合格者，則有基本分數78分。多出席一次，總分加3分，總分最高為95分，另外心得單內容亦列入任課老師的評分參考。出席/繳交比例未達規定者，以出席/繳交比例計分。缺席三次以上直接死當或心得單內容明顯不佳者，修課成績將會不及格。 2. 為鼓勵同學踴躍發言，如於課堂上提出問題者，一次加總分2分，總分最高為95分（表現特別優秀者可超過95分）。請有發問的同學，演講後當天請向助教登記，以利加分作業。若當天未告知，視同放棄。 3. 演講中途若有緊急事項須離席者，應向主持老師(或負責之助教)報告後才可離席，其出席之認定由任課老師視其情況處理之；若助教隨機抽點(拍照)發現有簽到而未在場者，當次以未出席論，同時扣總分20 分。 4. 為了尊重演講者及維持秩序，於聽講中不可喧嘩、使用手機、睡覺、飲食等行為。本學期中累計2次(含)以上者，以不及格論。 5. 對成績有疑慮者，請與助教確認。學期成績公告三天後，不受理任何異議。"}, "office_hr": {"en": "Reserved by Email", "ch": "來信預約"}, "teach_week": {"en": "16+2", "ch": "16+2"}, "flex_desc": {"en": "Select and study the topics provided by this semester's lecturers for in-depth understanding through research and information retrieval.", "ch": "自我選定研讀本學期演講者所提供之題材，檢索資料作深入了解。"}, "domain": {"en": "基礎學科", "ch": "基礎學科"}, "map": {"en": [{"competency": "Engineering Knowledge and Problem Analysis", "rate": "(3) Medium", "Assessments": "Assignments"}, {"competency": "Experiment and Implementation", "rate": "(0)", "Assessments": "No assessment"}, {"competency": "Design / Development of Solution and Investigation", "rate": "(3) Medium", "Assessments": "Assignments"}, {"competency": "Communication and Team Work", "rate": "(3) Medium", "Assessments": "Attendance/Performance ， Portfolios Assessment"}, {"competency": "The Engineer and Society", "rate": "(3) Medium", "Assessments": "Assignments"}], "ch": [{"competency": "專業知識與技能", "rate": "(3) 普通", "Assessments": "作業練習"}, {"competency": "實驗規劃與資料分析", "rate": "(0) 無", "Assessments": "無"}, {"competency": "工程設計與整合", "rate": "(3) 普通", "Assessments": "作業練習"}, {"competency": "合作溝通與管理", "rate": "(3) 普通", "Assessments": "出席/課堂表現 ， 學習檔案評量"}, {"competency": "專業倫理與社會責任", "rate": "(3) 普通", "Assessments": "作業練習"}]}, "asign_crite": {"en": ["Department:MSc in Mechanical Engineering only.Year:First Year only.identity:Non-International Students Only.", "Department:MSc in Mechanical Engineering only."], "ch": ["系所:限機械工程學系碩士班。年級:限一年級。身份:限非外籍生。", "系所:限機械工程學系碩士班。"]}, "prelim_sel": 127, "gender": {"male": 109, "female": 18}, "stu_depart": {"en": {"MSc in Mechanical Engineering": 127}, "ch": {"機械工程學系碩士班": 127}}, "stu_grade": {"Bachelor": {}, "Master": {"2": 1, "1": 126}, "Doctor": {}}}