{"serial": "07002", "department_serial": 5, "code": "CC0137", "class": "*", "name": {"en": "Introduction to Philosophy", "ch": "哲學概論"}, "notice": {"en": "", "ch": ""}, "instructor": {"en": ["Luh, Jing-Jong"], "ch": ["陸敬忠"]}, "credits": 3, "time_loc": [{"time": {"week": 2, "session": ["A", "B", "C"]}, "loc": {"building": "O", "room": "114"}}], "isRequired": false, "isFullSem": false, "MaxStu": 110, "department": {"ch": "總教學中心", "en": "Teaching Center"}, "system": {"ch": "學士班", "en": "Undergraduate Programme"}, "language": {"ch": "國語", "en": "Chinese"}, "card": {"ch": "部份使用", "en": "Optional"}, "assigned": 0, "selected": 0, "remark": {"ch": "", "en": ""}, "goal": {"ch": "我們為甚麼會思考哲學問題？何謂哲學？何為哲學的內容、亦即甚麼是哲學所探討的對象？哲學如何探究各式各樣不同的現象與問題？西方哲學從其生成發展史中始終呈現出其為思想方法，尤其是其反思、批判乃至解構的面向，使得哲學方法與人類文化中其他思想進路如神學或科學不同。因此，介紹西方哲學之思想進路應是培養學子批判思考之最佳途徑。本課程首先從哲學（philosophy）一詞之詞源出發，介紹哲思之基本問題意識，基本關懷以及基本思路，然後簡介哲學系統之基本分類亦即理論哲學及實踐哲學中的分科。接著進入傳統哲學史之向度：先從人類起源之特質出發發現人類之哲學精神起源，再進入四大文明作為西方哲學起源之對比脈絡，然後從古希臘文化之背景介紹西方古典希臘哲學之起源，揭示其與基督宗教之會通與對化，轉入現代西方哲學之基本派別，終至當代西方哲學諸學派與思潮如存在主義，現象學，語言哲學，詮釋學，乃至後現代之開示。", "en": ".Why do we think about philosophy? What is philosophy? What is the content of philosophy, i.e., what is the subject of philosophical inquiry? How does philosophy investigate different kinds of phenomena and problems? Throughout its history of development, Western philosophy has always demonstrated its approach to thought, especially its reflective, critical, and even deconstructive orientation, which makes philosophical approaches different from other approaches to thought in human culture, such as theology or science. Therefore, an introduction to Western philosophical thought processes is the best way to cultivate critical thinking in students. This course begins with the etymology of the word ‘philosophy’, introduces the basic problem-sense, basic concerns, and basic ideas of philosophical thought, and then goes on to introduce the basic classifications of philosophical systems, i.e., the subdivisions of theoretical philosophy and practical philosophy. Then we will move on to the traditional aspect of the history of philosophy: first, we will discover the spiritual origin of philosophy from the characteristics of human origins, then we will move on to the four major civilizations as the comparative origin of Western philosophy, then we will introduce the origin of classical Greek philosophy from the background of the ancient Greek culture, reveal its convergence and confrontation with the Christian religion, and then we will move on to the basic schools of modern Western philosophy, and finally to the schools of thought of contemporary Western philosophy such as existentialism, phenomenology, philosophy of language and linguistics, and so on. It will then move on to the basic schools of modern Western philosophy, and finally to the schools and trends of contemporary Western philosophy, such as existentialism, phenomenology, philosophy of language, hermeneutics, and even the post-modern era."}, "outline": {"ch": "1 課程說明2 中秋節補假3 哲學之意義 I：eros, philea, agape 以教科書及參考書為本，網路資料（如Wikipedia）為輔4 哲學之意義II：episteme,phronesis, sophia 以教科書及參考書為本，網路資料（如Wikipedia）為輔5 國慶補假6 哲學之系統I- 理論哲學系統1:邏輯以教科書及參考書為本，網路資料（如Wikipedia）為輔7 哲學之系統I- 理論哲學系統2:形上學以教科書及參考書為本，網路資料（如Wikipedia）為輔8 哲學之系統I- 理論哲學系統3:知識論以教科書及參考書為本，網路資料（如Wikipedia）為輔9  哲學之系統II- 實踐哲學系統1:倫理學以教科書及參考書為本，網路資料（如Wikipedia）為輔10 多媒體教學：多媒體教學：尼安德塔人，美索不達米亞文明，中國文明以教科書及參考書為本，網路資料（如Wikipedia）為輔11 哲學之系統II- 實踐哲學系統2:美學以教科書及參考書為本，網路資料（如Wikipedia）為輔12 哲學之系統II- 實踐哲學系統3:宗教哲學以教科書及參考書為本，網路資料（如Wikipedia）為輔13 哲學之歷史I-西方哲學之起源1:從人類起源談起以教科書及參考書為本，網路資料（如Wikipedia）為輔14 哲學之歷史I-西方哲學之起源2:四大文明之脈絡與古希臘哲學之緣起以教科書及參考書為本，網路資料（如Wikipedia）為輔15 哲學之歷史II-西方哲學和基督宗教之會遇與現代化：從古代至中世紀經驗主義與理性主義以教科書及參考書為本，網路資料（如Wikipedia）為輔16 哲學之歷史III-西方哲學之現代化：從近代哲學至德意志觀念論-從康德至黑格爾以教科書及參考書為本，網路資料（如Wikipedia）為輔", "en": ".1) Course Description 2) Mid-Autumn Festival Holiday 3) The Meaning of Philosophy I: eros, philea, agape. Based on textbooks and reference books, supplemented by internet data (e.g. Wikipedia) 4) The Meaning of Philosophy II: episteme, phronesis, sophia Based on textbooks and reference books, supplemented by internet data (e.g. Wikipedia) 5) National Day Holiday 6) System of Philosophy I - Theoretical Philosophical System 1: Logic based on textbooks and reference books, supplemented by internet sources (e.g. Wikipedia)7) System of Philosophy I - Theoretical Philosophical System 2: Metaphysics based on textbooks and reference books, supplemented by internet sources (e.g. Wikipedia)8) System of Philosophy I - Theoretical Philosophical System 3: Theory of Knowledge based on textbooks and reference books, supplemented by internet sources (e.g. Wikipedia)9) System of Philosophy I - Theoretical Philosophical System 4: Theory of Knowledge based on textbooks and reference books, supplemented by textbooks and reference books. System of Philosophy I - Theoretical Philosophy System 3: Theory of Knowledge based on textbooks and reference books, supplemented by online materials (e.g. Wikipedia). 9 System of Philosophy II - Practical Philosophy System 1: Ethics based on textbooks and reference books, supplemented by online materials (e.g. Wikipedia). 10) Multi-media Teaching: Neanderthal Man, Mesopotamian Civilization, and Chinese Civilization based on textbooks and reference books, supplemented by online materials (e.g. Wikipedia). 11) System of Philosophy II - Practicing Philosophical Systems 2: Aesthetics based on textbooks and reference books, supplemented by online materials (e.g., Wikipedia) 12) System of Philosophy II - Practicing Philosophical Systems 3: Philosophy of Religion based on textbooks and reference books, supplemented by online materials (e.g., Wikipedia)  13) History of Philosophy I - The Origins of Western Philosophy 1: Human Origins based on textbooks and  and reference books, supplemented by online resources (e.g., Wikipedia)14) History of Philosophy I-Origins of Western Philosophy 2: The Lineage of the Four Great Civilizations and the Roots of Ancient Greek Philosophy (textbooks and reference books), supplemented by online resources (e.g., Wikipedia)15) History of Philosophy II-Rendezvous with Western Philosophy and Christian Religion and its Modernization: Empiricism and Rationality from Antiquity to the Middle Ages (textbooks and reference books) 16) History of Philosophy III-Modernization of Western Philosophy: From Modern Philosophy to German Conceptualism-From Kant to Hegel Based on Textbooks and reference books, supplemented by online resources (e.g., Wikipedia)."}, "textbook": {"ch": "指定教科書1.西洋哲學史：傅偉勳，臺北，三民書局，1965年參考書目哲學概論：黃藿譯，學富出版社，2001.哲學概論：沈清松主編，五南出版社，2002哲學淺談：Joseph M. Bochenski著，王弘五譯註；臺北市：御書房出版，紅螞蟻圖書總經銷，2001.西洋哲學史：傅偉勳，臺北，三民書局，1965年", "en": "Reference:\nBarcalow, Emmett, Open Questions: An Introduction to Philosophy. Belmont, Calif.: Wadsworth Pub., 1993.Blackburn, Simon, Think: A Compelling Introduction to Philosophy. Oxford/New York: Oxford University Press, 1999.Copleston, Frederick Charles, A History of Philosophy: Volume I-IX, London: Burns, Oates ＆Washbourne, 1946 -1975.Cornman, James W. ＆ Keith Lehrer ＆ George S. Pappas, Philosophical Problems and Arguments: An Introduction. Taipei: YehYeh, 1984.Clark Glymour, Thinking Things Through: An Introduction to Philosophical Issues and Achievements. Cambridge, Mass.: MIT Press, 1992.Kupperman, Joel J., Philosophy: The Fundamental Problems. St. Martin’s Press, 1978.Nagel, Thomas, Mortal Questions. Cambridge: Cambridge University Press, 1979.Perry, John and Michael Bratman (Ed.), Introduction to Philosophy: Classical and Contemporary Readings. New York: Oxford University Press, 1993.Pojman, Louis P. (Ed.), Introduction to Philosophy: Classical and Contemporary Readings. Belmont, Calif.: Wadsworth Pub. Co., 1991.Trigg, Roger, Philosophy Matters: An Introduction to Philosophy. Malden, Mass.: Blackwell Publishers, 2002."}, "selfCompiledRate": {"ch": "80", "en": "80"}, "instructMethod": {"ch": "講授", "en": ["Lecture"]}, "gradMethod": {"ch": "出席及討論：30％，期中考試：30％，期末考試：40％\n預計期中考試時間:第八周即十月三十一日\n預計期末考試時間:第十六周即十二月二十六日", "en": ".Attendance ＆ Discussion: 30％, Midterm Exam: 30％, Final Exam: 40％\nExpected midterm exam: Week 8, October 31st.\nExpected Final Exam: 16th week (December 26)"}, "officeHour": {"ch": "與教師另預約", "en": "與教師另預約"}, "teachWeeks": {"ch": "16+2", "en": "16+2"}, "flexDiscription": {"ch": "彈性教學兩週以視聽媒體教學以及學生參加哲學研究所或詮釋學哲學研究室所舉辦哲學相關演講為加深加廣教學或學術活動。", "en": "Two-week flexible teaching is supplemented by audio-visual media teaching and student participation in philosophy-related lectures given by the Graduate Institute of Philosophy or the Research Center of Hermeneutics and Intercultural Philosophy."}, "domain": {"ch": "人文與思想領域", "en": "人文與思想領域"}, "map": {"ch": [{"competencies": "邏輯與創新", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "多元與溝通", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "美感與鑑賞", "rating": "(4)高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "關懷與實踐", "rating": "(3)普通", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}], "en": [{"competencies": "", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "", "rating": "(4)High", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "", "rating": "(3)Medium", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}]}, "assignCriteria": {"ch": ["學制:限學士班。年級:限四年級。", "學制:限學士班。"], "en": ["Type:Undergraduate Program only.Year:Fourth Year only.", "Type:Undergraduate Program only."]}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 0}, "stuGrade": {"doctor": {}, "master": {}, "bachelor": {}}, "stus": []}