{"serial": "34031", "department_serial": 32, "code": "CH8097", "class": "*", "name": {"en": "Bio-inspired Materials", "ch": "生物啟發材料"}, "notice": {"en": "", "ch": "研究所領域分類：材料類"}, "instructor": {"en": ["Lee, Tu"], "ch": ["李度"]}, "credits": 3, "time_loc": [{"time": {"week": 5, "session": ["2", "3", "4"]}, "loc": {"building": "E", "room": "360"}}], "isRequired": false, "isFullSem": false, "MaxStu": 65, "department": {"ch": "化學工程與材料工程學系", "en": "Department of  Chemical Engineering"}, "system": {"ch": "碩博同修", "en": "Master/Doctoral Programme"}, "language": {"ch": "英語", "en": "English"}, "card": {"ch": "部份使用", "en": "Optional"}, "assigned": 10, "selected": 0, "remark": {"ch": "研究所領域分類：材料類", "en": ""}, "goal": {"ch": "本課所用教材以英文為主，進而提高學生閱讀能力，並且培養學生具有：(1) 國際觀(瞭解現在最熱寧的領域，閱讀國外期刊) (2) 整合能力(自我閱讀英文論文，做出有條理的簡報) (3) 表達能力(在報告時會依簡報設計，參考文獻，英文拼字，內容，流暢度，手勢，自信，發音，眼神交會，聲量，邏輯，思路清晰度，語調，深度及回答問題好壞來做評分。) (4) 創造力(是否把所學運用在自己研究上，能否把枯燥的題目變得生動) (5) 領導的能力(掌控完成報告所需時間，報告的品質管理，自訂報告的內容)。此外上課的文獻就生物啟發材料的五大特色，可分成八個單元，每個單元都涵蓋三部分：(1)生物啟發的特色，(2)生活中可以利用生物啟發材料來解決問題，(3)生物啟發材料的解決方法。學生通過對這八個單元所做的個人研讀，可以對生物啟發材料有更廣與更深的了解。希望學生能舉一反三，運用在自己的研究範疇。", "en": "“Biomaterials have been around for a long time.  They have evolved into many superb functional materials under the process of natural selection.  Therefore, using them as an inspirational source is very common to scientists.  Although many biomedical materials or active pharmaceutical ingredients are derived from natural products, only a few of the synthetic materials, composite materials and advanced functional materials based on bio-inspiration are discovered and designed in the areas of materials science and engineering.  It becomes more important than ever to investigate bio-inspired materials and technology nowadays.  We have collected more than 45 papers from different journals (ex: International Journal of Pharmaceutical, Journal of Physics D: Applied Physics, Nature and Science, etc.) in this course covering disciplines such as molecular biology, chemistry, physics, chemical engineering, polymers, semiconductors, optoelectronics and pharmaceutical engineering, investigating the materials structure from nanometer scale all the way to micron level.  We will devote our time to six important features in bio-inspiration: chirality, polymorphism, self-assembly, molecular recognition, patterning, and hierarchical structures, by bottom-up fabrication.\nAll teaching and reading materials are written in English.  Hopefully, the reading abilities of students will be elevated.  Students are expected to cultivate: (1) international views (i.e. by following the current trend in research and reading foreign journals), (2) integration skills (i.e. by studying the papers independently and preparing logical power-point presentations), (3) communication skills (i.e. the grading of presentation is based on presentation design, references, spellings, contents, fluency, gestures, confidence, punctuality, eye contact, voice level, logics, clarity, modulation, depth and answers to questions), (4) innovation (i.e. applying the knowledge on the research and turning a boring subject into an interesting topic), and (5) leadership (i.e. time management, spontaneity, presentation design).  The five key features of bio-inspiration are divided into eight modules, and each module is composed of three parts: (1) the uniqueness of bio-inspiration, (2) real-life problems which can be solved by bio-inspired materials and technology, and (3) solutions offered by bio-inspired materials and technology.  Thorough the personal study of these eight modules, students can gain understandings of bio-inspired materials and technology.  We hope students can eventually reason and think on their own, and to apply the insight in their own research areas.“"}, "outline": {"ch": "生物啟發材料與技術 2024 年秋季課程\n主辦教授：Tu Lee 教授\n時間：每週五上午 9:00 – 11:50\n地點：工程大樓 1，E233\n這是一門以英語授課的密集閱讀課程。生物學或生物化學背景不是必需的。課程分為八個不同的模組（見表 1），每個模組的閱讀作業在參考資料中列出。學生需閱讀所有指定資料，並以 5 至 10 頁的 PowerPoint 格式進行報告。具體的報告主題將在課堂上分配。每位學生需進行總共 7 次報告（平均每個模組一次）。每次報告占 10％ 的成績。課程中還會有一個 20 分鐘的期中報告，針對特殊主題，該報告占 15％ 的成績。最終還需要提交一篇期末論文及報告，主題也需針對特殊主題，該部分占 15％ 的成績。期中報告和期末論文的主題必須在 2024 年 11 月 8 日和 2024 年 12 月 27 日之前與教授充分討論後確定。報告和論文的格式將在課堂上公告。", "en": "“Bioinspired Materials and Technology Fall 2024Host: Prof. Tu LeeTime: Fridays 9:00 – 11:50 a.m.Place: Engineering Building 1, E233This is an English speaking, intensive reading course. Biology or biochemistry background is NOT required. The course is divided into eight different modules (Table 1) and the reading assignments for each module is shown in references. Students are expected to read All assignments and to present what they read in a 5 to 10-page PowerPoint format. Different specific presentation topics will be assigned in the class. There will be a total of 7 presentations (one presentation/module on average) for each student. Each presentation is worth 10 ％. There will be a 20-minute Midterm Presentation on a special topic which is worth 15 ％. There will also be a Final Term Paper and Presentation on a special topic of 15 ％. The final decision on the topics of Midterm Presentation and Final Term Paper MUST be made by a thorough discussion between students and the professor before 11/8/2024 and 12/27/2024, respectively. The format of the presentation and the term paper will be announced in the class."}, "textbook": {"ch": "Module 1: Why Do We Need Bio-inspired Materials and Technology?\nWei, J. Molecular Structure and Property: Product Engineering. Ind. Eng. Chem. Res. 2002, 41 (8), 1917–1919.\nPorter, M. M.; McKittrick, J. It’s Tough to be Strong: Advances in Bioinspired Structural Ceramic-Based Materials. Am. Ceram. Soc. Bull. 2014, 93, 18–24.\nHarris, J.; Böhm, C. F.; Wolf, S. E. Universal Structure Motifs in Biominerals: A Lesson from Nature for the Efficient Design of Bioinspired Functional Materials. Interface Focus 2017, 7 (4), 1-9.\nMadhav, D.; Buffel, B.; Desplentere, F.; Moldenaers, P.; Vandeginste, V. Bio-Inspired Mineralization of CO2 into CaCO3: Single-Step Carbon Capture and Utilization with Controlled Crystallization. Fuel 2023, 345, 128157.\nSoten, I.; Ozin, G. A. New Directions in Self-Assembly: Materials Synthesis Over “All” Length Scales. Curr. Opin. Colloid Interface Sci. 1999, 4 (5), 325–337. \n\nModule 2: Chirality Control\nLevy-Lior, A.; Weiner, S.; Addadi, L. Achiral Calcium‐oxalate Crystals with Chiral Morphology from the Leaves of Some Solanacea Plants. Helv. Chim. Acta 2003, 86 (12), 4007–4017.\nQing, G.; Zhao, S.; Xiong, Y.; Lv, Z.; Jiang, F.; Liu, Y.; Chen, H.; Zhang, M.; Sun, T. Chiral Effect at Protein/Graphene Interface: A Bioinspired Perspective to Understand Amyloid Formation. J. Am. Chem. Soc. 2014, 136 (30), 10736–10742.\nPark, H.; Kim, K. M.; Lee, A.; Ham, S.; Nam, W.; Chin, J. Bioinspired Chemical Inversion of L-Amino Acids to d-Amino Acids. J. Am. Chem. Soc. 2007, 129 (6), 1518–1519.\nReal-life Problems\nZhang, G. G. Z.; Paspal, S. Y. L.; Suryanarayanan, R.; Grant, D. J. W. Racemic Species of Sodium Ibuprofen: Characterization and Polymorphic Relationships. J. Pharm. Sci. 2003, 92 (7), 1356–1366.\nSioncke, S.; Verbiest, T.; Persoons, A. Second-Order Nonlinear Optical Properties of Chiral Materials. Mater. Sci. Eng. R Rep. 2003, 42 (5–6), 115–155.\nWang, G.; Zhang, H.; Kuang, H.; Xu, C.; Xu, L. Chiral Inorganic Nanomaterials for Bioapplications. Matter 2023, 6 (6), 1752–1781.\nBioinspired Materials and Technology\nOrme, C. A.; Noy, A.; Wierzbicki, A.; McBride, M. T.; Grantham, M.; Teng, H. H.; Dove, P. M.; DeYoreo, J. J. Formation of Chiral Morphologies through Selective Binding of Amino Acids to Calcite Surface Steps. Nature 2001, 411 (6839), 775–779. \nHuang, X.; Li, C.; Jiang, S.; Wang, X.; Zhang, B.; Liu, M. Self-Assembled Spiral Nanoarchitecture and Supramolecular Chirality in Langmuir−Blodgett Films of an Achiral Amphiphilic Barbituric Acid. J. Am. Chem. Soc. 2004, 126 (5), 1322–1323.\n\nModule 3: Polymorphism Control\nHood, M. A.; Landfester, K.; Muñoz-Espí, R. Chitosan Nanoparticles Affect Polymorph Selection in Crystallization of Calcium Carbonate. Colloids Surf. A Physicochem. Eng. Asp. 2018, 540, 48–52. \nLiu, M.-F.; Lu, Z.; Zhang, Z.; Xiao, C.; Li, M.; Huang, Y.-X.; Liu, X. Y.; Jiang, Y. Correlations of Crystal Shape and Lateral Orientation in Bioinspired CaCO3Mineralization. CrystEngComm 2018, 20 (35), 5241–5248.\nYang, T.; Jho, J.; Kim, I. Epitaxial Relationships between Calcium Carbonate and Inorganic Substrates. Int. J. Mol. Sci. 2014, 15 (9), 16320–16330.\nDeclet, A.; Reyes, E.; Suárez, O. M. Calcium Carbonate Precipitation: A Review of the Carbonate Crystallization Process and Applications in Bioinspired Composites.\nRev. Adv. Mater. Sci. 2016, 44, 87–107.\nChung, K.; Yu, S.; Heo, C.-J.; Shim, J. W.; Yang, S.-M.; Han, M. G.; Lee, H.-S.; Jin, Y.; Lee, S. Y.; Park, N.; Shin, J. H. Flexible, Angle‐independent, Structural Color Reflectors Inspired by Morpho Butterfly Wings. Adv. Mater. 2012, 24 (18), 2375–2379.\nThrelfall, T. L. Analysis of Organic Polymorphs. A Review. Analyst 1995, 120 (10), 2435.\nReal-life Problems\nChen, Z.; Ogino, K.; Miyata, S.; Lu, Y.; Watanabe, T. The Pure White Light Emission from Three-Layer Electroluminescent Device, J. Phys. D: Appl. Phys., 2002, 35, 742-746.\nFryer, P.; Pinschower, K. The Materials Science of Chocolate. MRS Bull. 2000, \n25 (12), 25–29.\nHensley, A.; Jacobs, W. M.; Rogers, W. B. Self-Assembly of Photonic Crystals by Controlling the Nucleation and Growth of DNA-Coated Colloids. Proc. Natl. Acad. Sci. U. S. A. 2022, 119 (1), e2114050118.\nBioinspired Materials and Technology\nLee, A. Y.; Ulman, A.; Myerson, A. S. Crystallization of Amino Acids on Self-Assembled Monolayers of Rigid Thiols on Gold. Langmuir 2002, 18 (15), 5886–5898.\nLee, T. Crystal Nucleating Chip for Forming Crystals and Determining Crystal Polymorphism and Crystal Habit. Pat. Appl. Publ 2003, 15 pp. US 20030068252 A1.\nJi, B.; Cusack, M.; Freer, A.; Dobson, P. S.; Gadegaard, N.; Yin, H. Control of Crystal Polymorph in Microfluidics Using Molluscan 28 kDa Ca2+-Binding Protein. Integr. Biol. 2010, 2 (10), 528–535.\n\nModule 4: Nanosized Bio-materials\nDu, C.; Falini, G.; Fermani, S.; Abbott, C.; Moradian-Oldak, J. Supramolecular Assembly of Amelogenin Nanospheres into Birefringent Microribbons. Science 2005, 307 (5714), 1450–1454.\nReal-life Problems\nRichard W. Siegel, Exploring Mesoscopia: The Bold New World of Nanostructures,\nPhysics Today, 1993, 46 (10), 64-68.\nAlivisatos, A. P. Semiconductor Clusters, Nanocrystals, and Quantum Dots. Science 1996, 271 (5251), 933–937.\nShi, J.; Gider, S.; Babcock, K.; Awschalom, D. D. Magnetic Clusters in Molecular Beams, Metals, and Semiconductors. Science 1996, 271 (5251), 937–941.\nBioinspired Materials and Technology\nPuntes, V. F.; Krishnan, K. M.; Alivisatos, A. P. Colloidal Nanocrystal Shape and Size Control: The Case of Cobalt. Science 2001, 291 (5511), 2115–2117.\nMann, S.; Hannington, J. P.; Williams, R. J. P. Phospholipid Vesicles as a Model System for Biomineralization. Nature 1986, 324 (6097), 565–567.\nDouglas, T.; Strable, E.; Willits, D.; Aitouchen, A.; Libera, M.; Young, M. Protein Engineering of a Viral Cage for Constrained Nanomaterials Synthesis. Adv. Mater. 2002, 14 (6), 415–418.\nSchaffner, M.; England, G.; Kolle, M.; Aizenberg, J.; Vogel, N. Combining Bottom‐up Self‐assembly with Top‐down Microfabrication to Create Hierarchical Inverse Opals with High Structural Order. Small 2015, 11 (34), 4334–4340.\nLi, M.; Liu, M.; Qi, F.; Lin, F. R.; Jen, A. K.-Y. Self-Assembled Monolayers for Interfacial Engineering in Solution-Processed Thin-Film Electronic Devices: Design, Fabrication, and Applications. Chem. Rev. 2024, 124 (5), 2138–2204.\n\nModule 5: Patterned Bio-materials\nZhao, X.; Xiong, Y.; Wang, W.; Zhang, W.; Zhang, D. Achieving Structural White Inspired by Quasiordered Microstructures in Morpho theseus. NPG Asia Mater. 2023, 15 (1), 1–11.\nViela, F.; Navarro-Baena, I.; Hernández, J. J.; Osorio, M. R.; Rodríguez, I. Moth-Eye Mimetic Cytocompatible Bactericidal Nanotopography: A Convergent Design. Bioinspir. Biomim. 2018, 13 (2), 026011.\nYin, K.; Du, H.; Dong, X.; Wang, C.; Duan, J.-A.; He, J. A Simple Way to Achieve Bioinspired Hybrid Wettability Surface with Micro/Nanopatterns for Efficient Fog Collection. Nanoscale 2017, 9 (38), 14620–14626.\nReal-life Problems\nLanger,R. Drugs on Target, Science, (2001) 239: 58-59.\nBuot, F. A. Mesoscopic Physics and Nanoelectronics: Nanoscience and Nanotechnology. Phys. Rep. 1993, 234 (2–3), 73–174.\nKelley, T. W.; Baude, P. F.; Gerlach, C.; Ender, D. E.; Muyres, D.; Haase, M. A.; Vogel, D. E.; Theiss, S. D. Recent Progress in Organic Electronics: Materials, Devices, and Processes. Chem. Mater. 2004, 16 (23), 4413–4422.\nPadole, M.; Gharde, S.; Kandasubramanian, B. Three-Dimensional Printing of Molluscan Shell Inspired Architectures via Fused Deposition Modeling. Environ. Sci. Pollut. Res. Int. 2021, 28 (34), 46356–46366.\nDu, G.; Mao, A.; Yu, J.; Hou, J.; Zhao, N.; Han, J.; Zhao, Q.; Gao, W.; Xie, T.; Bai, H. Nacre-Mimetic Composite with Intrinsic Self-Healing and Shape-Programming Capability. Nat. Commun. 2019, 10 (1), 1–8.\nBioinspired Materials and Technology\nAizenberg, J. Crystallization in Patterns: A Bio‐inspired Approach. Adv. Mater. 2004, 16 (15), 1295–1302.\nYao, X.; Chen, Q.; Xu, L.; Li, Q.; Song, Y.; Gao, X.; Quéré, D.; Jiang, L. Bioinspired Ribbed Nanoneedles with Robust Superhydrophobicity. Adv. Funct. Mater. 2010, 20 (4), 656–662.\nKamat, A. M.; Pei, Y.; Kottapalli, A. G. P. Bioinspired Cilia Sensors with Graphene Sensing Elements Fabricated Using 3D Printing and Casting. Nanomaterials (Basel) 2019, 9 (7), 954.\n\nModule 6: Molecular Recognitions\nHuang, Z.; Shi, X.; Wang, G.; Leukkunen, P.; Huttula, M.; Cao, W. Antireflective Design of Si-Based Photovoltaics via Biomimicking Structures on Black Butterfly Scales. Sol. Energy 2020, 204, 738–747.\nReal-life Problems\nLi, W.; Huang, H.; Deng, J. Bioinspired Hybrid Material Composed of Helical Polymer Grafts and Graphene Oxide: Reversible Transformation of Particulate and Extended Structures of the Grafts and Application in Chiral Enrichment. Polymer (Guildf.) 2016, 101, 284–290.\nLin, W.; Hong, W.; Sun, L.; Yu, D.; Yu, D.; Chen, X. Bioinspired Mesoporous Chiral Nematic Graphitic Carbon Nitride Photocatalysts Modulated by Polarized Light. ChemSusChem 2018, 11 (1), 114–119.\nBioinspired Materials and Technology\nSellergren, B. Imprinted Polymers with Memory for Small Molecules, Proteins, or Crystals. Angew. Chem. Int. Ed Engl. 2000, 39 (6), 1031–1037.\nWhaley, S. R.; English, D. S.; Hu, E. L.; Barbara, P. F.; Belcher, A. M. Selection of Peptides with Semiconductor Binding Specificity for Directed Nanocrystal Assembly. Nature 2000, 405 (6787), 665–668. \nKokan, Z.; Kirin, S. I. The Application of “Backdoor Induction” in Bioinspired Asymmetric Catalysis. RSC Adv. 2012, 2 (13), 5729.\n\nModule 7: Hierarchical Structures\n\nTaton, T. A. Boning up on Biology. Nature 2001, 412 (6846), 491–492.\nLi, K.; Li, C.; Li, H.; Li, M.; Song, Y. Designable Structural Coloration by Colloidal Particle Assembly: From Nature to Artificial Manufacturing. iScience 2021, 24 (2), 102121.\nPrabhu, D. D.; Aratsu, K.; Kitamoto, Y.; Ouchi, H.; Ohba, T.; Hollamby, M. J.; Shimizu, N.; Takagi, H.; Haruki, R.; Adachi, S.-I.; Yagai, S. Self-Folding of Supramolecular Polymers into Bioinspired Topology. Sci. Adv. 2018, 4 (9).\nAvinash, M. B.; Raut, D.; Mishra, M. K.; Ramamurty, U.; Govindaraju, T. Bioinspired Reductionistic Peptide Engineering for Exceptional Mechanical Properties. Sci. Rep. 2015, 5 (1), 1–8.\nJehle, F.; Fratzl, P.; Harrington, M. J. Metal-Tunable Self-Assembly of Hierarchical Structure in Mussel-Inspired Peptide Films. ACS Nano 2018, 12 (3), 2160–2168.\nReal-life Problems\nLanger, R. Biomaterials: Status, Challenges, and Perspectives. AIChE J. 2000, 46 (7), 1286–1289.\nBioinspired Materials and Technology\nTan, J.; Saltzman, W. M. Biomaterials with Hierarchically Defined Micro- and Nanoscale Structure. Biomaterials 2004, 25 (17), 3593–3601.\nLee, T.; Aksay, I. A. Hierarchical Structure−Ferroelectricity Relationships of Barium Titanate Particles. Cryst. Growth Des. 2001, 1 (5), 401–419.\nLibanori, R.; Münch, F. H. L.; Montenegro, D. M.; Studart, A. R. Hierarchical Reinforcement of Polyurethane-Based Composites with Inorganic Micro- and Nanoplatelets. Compos. Sci. Technol. 2012, 72 (3), 435–445.\nChen, R.; Liu, J.; Yang, C.; Weitz, D. A.; He, H.; Li, D.; Chen, D.; Liu, K.; Bai, H. Transparent Impact-Resistant Composite Films with Bioinspired Hierarchical Structure. ACS Appl. Mater. Interfaces 2019, 11 (26), 23616–23622.\nFang, J.; Gu, J.; Liu, Q.; Zhang, W.; Su, H.; Zhang, D. Three-Dimensional CdS/Au Butterfly Wing Scales with Hierarchical Rib Structures for Plasmon-Enhanced Photocatalytic Hydrogen Production. ACS Appl. Mater. Interfaces 2018, 10 (23), 19649–19655.\nCao, S. C.; Liu, J.; Zhu, L.; Li, L.; Dao, M.; Lu, J.; Ritchie, R. O. Nature-Inspired Hierarchical Steels. Sci. Rep. 2018, 8 (1), 1–7.\nBouville, F.; Maire, E.; Meille, S.; Van de Moortèle, B.; Stevenson, A. J.; Deville, S. Strong, Tough and Stiff Bioinspired Ceramics from Brittle Constituents. Nat. Mater. 2014, 13 (5), 508–514.\n\nModule 8: How Can the Lessons be Applied to Your Research or Interest?\nOpen Discussion\n\nMid Term and Final Term\nRen, J.; Liu, Q.; Pei, Y.; Wang, Y.; Yang, S.; Lin, S.; Chen, W.; Ling, S.; Kaplan, D. L. Bioinspired Energy Storage and Harvesting Devices. Adv. Mater. Technol. 2021, 6 (9).\nKatiyar, N. K.; Goel, G.; Hawi, S.; Goel, S. Nature-Inspired Materials: Emerging Trends and Prospects. NPG Asia Mater. 2021, 13 (1), 1–16.", "en": "Module 1: Why Do We Need Bio-inspired Materials and Technology?\nWei, J. Molecular Structure and Property: Product Engineering. Ind. Eng. Chem. Res. 2002, 41 (8), 1917–1919.\nPorter, M. M.; McKittrick, J. It’s Tough to be Strong: Advances in Bioinspired Structural Ceramic-Based Materials. Am. Ceram. Soc. Bull. 2014, 93, 18–24.\nHarris, J.; Böhm, C. F.; Wolf, S. E. Universal Structure Motifs in Biominerals: A Lesson from Nature for the Efficient Design of Bioinspired Functional Materials. Interface Focus 2017, 7 (4), 1-9.\nMadhav, D.; Buffel, B.; Desplentere, F.; Moldenaers, P.; Vandeginste, V. Bio-Inspired Mineralization of CO2 into CaCO3: Single-Step Carbon Capture and Utilization with Controlled Crystallization. Fuel 2023, 345, 128157.\nSoten, I.; Ozin, G. A. New Directions in Self-Assembly: Materials Synthesis Over “All” Length Scales. Curr. Opin. Colloid Interface Sci. 1999, 4 (5), 325–337. \n\nModule 2: Chirality Control\nLevy-Lior, A.; Weiner, S.; Addadi, L. Achiral Calcium‐oxalate Crystals with Chiral Morphology from the Leaves of Some Solanacea Plants. Helv. Chim. Acta 2003, 86 (12), 4007–4017.\nQing, G.; Zhao, S.; Xiong, Y.; Lv, Z.; Jiang, F.; Liu, Y.; Chen, H.; Zhang, M.; Sun, T. Chiral Effect at Protein/Graphene Interface: A Bioinspired Perspective to Understand Amyloid Formation. J. Am. Chem. Soc. 2014, 136 (30), 10736–10742.\nPark, H.; Kim, K. M.; Lee, A.; Ham, S.; Nam, W.; Chin, J. Bioinspired Chemical Inversion of L-Amino Acids to d-Amino Acids. J. Am. Chem. Soc. 2007, 129 (6), 1518–1519.\nReal-life Problems\nZhang, G. G. Z.; Paspal, S. Y. L.; Suryanarayanan, R.; Grant, D. J. W. Racemic Species of Sodium Ibuprofen: Characterization and Polymorphic Relationships. J. Pharm. Sci. 2003, 92 (7), 1356–1366.\nSioncke, S.; Verbiest, T.; Persoons, A. Second-Order Nonlinear Optical Properties of Chiral Materials. Mater. Sci. Eng. R Rep. 2003, 42 (5–6), 115–155.\nWang, G.; Zhang, H.; Kuang, H.; Xu, C.; Xu, L. Chiral Inorganic Nanomaterials for Bioapplications. Matter 2023, 6 (6), 1752–1781.\nBioinspired Materials and Technology\nOrme, C. A.; Noy, A.; Wierzbicki, A.; McBride, M. T.; Grantham, M.; Teng, H. H.; Dove, P. M.; DeYoreo, J. J. Formation of Chiral Morphologies through Selective Binding of Amino Acids to Calcite Surface Steps. Nature 2001, 411 (6839), 775–779. \nHuang, X.; Li, C.; Jiang, S.; Wang, X.; Zhang, B.; Liu, M. Self-Assembled Spiral Nanoarchitecture and Supramolecular Chirality in Langmuir−Blodgett Films of an Achiral Amphiphilic Barbituric Acid. J. Am. Chem. Soc. 2004, 126 (5), 1322–1323.\n\nModule 3: Polymorphism Control\nHood, M. A.; Landfester, K.; Muñoz-Espí, R. Chitosan Nanoparticles Affect Polymorph Selection in Crystallization of Calcium Carbonate. Colloids Surf. A Physicochem. Eng. Asp. 2018, 540, 48–52. \nLiu, M.-F.; Lu, Z.; Zhang, Z.; Xiao, C.; Li, M.; Huang, Y.-X.; Liu, X. Y.; Jiang, Y. Correlations of Crystal Shape and Lateral Orientation in Bioinspired CaCO3Mineralization. CrystEngComm 2018, 20 (35), 5241–5248.\nYang, T.; Jho, J.; Kim, I. Epitaxial Relationships between Calcium Carbonate and Inorganic Substrates. Int. J. Mol. Sci. 2014, 15 (9), 16320–16330.\nDeclet, A.; Reyes, E.; Suárez, O. M. Calcium Carbonate Precipitation: A Review of the Carbonate Crystallization Process and Applications in Bioinspired Composites.\nRev. Adv. Mater. Sci. 2016, 44, 87–107.\nChung, K.; Yu, S.; Heo, C.-J.; Shim, J. W.; Yang, S.-M.; Han, M. G.; Lee, H.-S.; Jin, Y.; Lee, S. Y.; Park, N.; Shin, J. H. Flexible, Angle‐independent, Structural Color Reflectors Inspired by Morpho Butterfly Wings. Adv. Mater. 2012, 24 (18), 2375–2379.\nThrelfall, T. L. Analysis of Organic Polymorphs. A Review. Analyst 1995, 120 (10), 2435.\nReal-life Problems\nChen, Z.; Ogino, K.; Miyata, S.; Lu, Y.; Watanabe, T. The Pure White Light Emission from Three-Layer Electroluminescent Device, J. Phys. D: Appl. Phys., 2002, 35, 742-746.\nFryer, P.; Pinschower, K. The Materials Science of Chocolate. MRS Bull. 2000, \n25 (12), 25–29.\nHensley, A.; Jacobs, W. M.; Rogers, W. B. Self-Assembly of Photonic Crystals by Controlling the Nucleation and Growth of DNA-Coated Colloids. Proc. Natl. Acad. Sci. U. S. A. 2022, 119 (1), e2114050118.\nBioinspired Materials and Technology\nLee, A. Y.; Ulman, A.; Myerson, A. S. Crystallization of Amino Acids on Self-Assembled Monolayers of Rigid Thiols on Gold. Langmuir 2002, 18 (15), 5886–5898.\nLee, T. Crystal Nucleating Chip for Forming Crystals and Determining Crystal Polymorphism and Crystal Habit. Pat. Appl. Publ 2003, 15 pp. US 20030068252 A1.\nJi, B.; Cusack, M.; Freer, A.; Dobson, P. S.; Gadegaard, N.; Yin, H. Control of Crystal Polymorph in Microfluidics Using Molluscan 28 kDa Ca2+-Binding Protein. Integr. Biol. 2010, 2 (10), 528–535.\n\nModule 4: Nanosized Bio-materials\nDu, C.; Falini, G.; Fermani, S.; Abbott, C.; Moradian-Oldak, J. Supramolecular Assembly of Amelogenin Nanospheres into Birefringent Microribbons. Science 2005, 307 (5714), 1450–1454.\nReal-life Problems\nRichard W. Siegel, Exploring Mesoscopia: The Bold New World of Nanostructures,\nPhysics Today, 1993, 46 (10), 64-68.\nAlivisatos, A. P. Semiconductor Clusters, Nanocrystals, and Quantum Dots. Science 1996, 271 (5251), 933–937.\nShi, J.; Gider, S.; Babcock, K.; Awschalom, D. D. Magnetic Clusters in Molecular Beams, Metals, and Semiconductors. Science 1996, 271 (5251), 937–941.\nBioinspired Materials and Technology\nPuntes, V. F.; Krishnan, K. M.; Alivisatos, A. P. Colloidal Nanocrystal Shape and Size Control: The Case of Cobalt. Science 2001, 291 (5511), 2115–2117.\nMann, S.; Hannington, J. P.; Williams, R. J. P. Phospholipid Vesicles as a Model System for Biomineralization. Nature 1986, 324 (6097), 565–567.\nDouglas, T.; Strable, E.; Willits, D.; Aitouchen, A.; Libera, M.; Young, M. Protein Engineering of a Viral Cage for Constrained Nanomaterials Synthesis. Adv. Mater. 2002, 14 (6), 415–418.\nSchaffner, M.; England, G.; Kolle, M.; Aizenberg, J.; Vogel, N. Combining Bottom‐up Self‐assembly with Top‐down Microfabrication to Create Hierarchical Inverse Opals with High Structural Order. Small 2015, 11 (34), 4334–4340.\nLi, M.; Liu, M.; Qi, F.; Lin, F. R.; Jen, A. K.-Y. Self-Assembled Monolayers for Interfacial Engineering in Solution-Processed Thin-Film Electronic Devices: Design, Fabrication, and Applications. Chem. Rev. 2024, 124 (5), 2138–2204.\n\nModule 5: Patterned Bio-materials\nZhao, X.; Xiong, Y.; Wang, W.; Zhang, W.; Zhang, D. Achieving Structural White Inspired by Quasiordered Microstructures in Morpho theseus. NPG Asia Mater. 2023, 15 (1), 1–11.\nViela, F.; Navarro-Baena, I.; Hernández, J. J.; Osorio, M. R.; Rodríguez, I. Moth-Eye Mimetic Cytocompatible Bactericidal Nanotopography: A Convergent Design. Bioinspir. Biomim. 2018, 13 (2), 026011.\nYin, K.; Du, H.; Dong, X.; Wang, C.; Duan, J.-A.; He, J. A Simple Way to Achieve Bioinspired Hybrid Wettability Surface with Micro/Nanopatterns for Efficient Fog Collection. Nanoscale 2017, 9 (38), 14620–14626.\nReal-life Problems\nLanger,R. Drugs on Target, Science, (2001) 239: 58-59.\nBuot, F. A. Mesoscopic Physics and Nanoelectronics: Nanoscience and Nanotechnology. Phys. Rep. 1993, 234 (2–3), 73–174.\nKelley, T. W.; Baude, P. F.; Gerlach, C.; Ender, D. E.; Muyres, D.; Haase, M. A.; Vogel, D. E.; Theiss, S. D. Recent Progress in Organic Electronics: Materials, Devices, and Processes. Chem. Mater. 2004, 16 (23), 4413–4422.\nPadole, M.; Gharde, S.; Kandasubramanian, B. Three-Dimensional Printing of Molluscan Shell Inspired Architectures via Fused Deposition Modeling. Environ. Sci. Pollut. Res. Int. 2021, 28 (34), 46356–46366.\nDu, G.; Mao, A.; Yu, J.; Hou, J.; Zhao, N.; Han, J.; Zhao, Q.; Gao, W.; Xie, T.; Bai, H. Nacre-Mimetic Composite with Intrinsic Self-Healing and Shape-Programming Capability. Nat. Commun. 2019, 10 (1), 1–8.\nBioinspired Materials and Technology\nAizenberg, J. Crystallization in Patterns: A Bio‐inspired Approach. Adv. Mater. 2004, 16 (15), 1295–1302.\nYao, X.; Chen, Q.; Xu, L.; Li, Q.; Song, Y.; Gao, X.; Quéré, D.; Jiang, L. Bioinspired Ribbed Nanoneedles with Robust Superhydrophobicity. Adv. Funct. Mater. 2010, 20 (4), 656–662.\nKamat, A. M.; Pei, Y.; Kottapalli, A. G. P. Bioinspired Cilia Sensors with Graphene Sensing Elements Fabricated Using 3D Printing and Casting. Nanomaterials (Basel) 2019, 9 (7), 954.\n\nModule 6: Molecular Recognitions\nHuang, Z.; Shi, X.; Wang, G.; Leukkunen, P.; Huttula, M.; Cao, W. Antireflective Design of Si-Based Photovoltaics via Biomimicking Structures on Black Butterfly Scales. Sol. Energy 2020, 204, 738–747.\nReal-life Problems\nLi, W.; Huang, H.; Deng, J. Bioinspired Hybrid Material Composed of Helical Polymer Grafts and Graphene Oxide: Reversible Transformation of Particulate and Extended Structures of the Grafts and Application in Chiral Enrichment. Polymer (Guildf.) 2016, 101, 284–290.\nLin, W.; Hong, W.; Sun, L.; Yu, D.; Yu, D.; Chen, X. Bioinspired Mesoporous Chiral Nematic Graphitic Carbon Nitride Photocatalysts Modulated by Polarized Light. ChemSusChem 2018, 11 (1), 114–119.\nBioinspired Materials and Technology\nSellergren, B. Imprinted Polymers with Memory for Small Molecules, Proteins, or Crystals. Angew. Chem. Int. Ed Engl. 2000, 39 (6), 1031–1037.\nWhaley, S. R.; English, D. S.; Hu, E. L.; Barbara, P. F.; Belcher, A. M. Selection of Peptides with Semiconductor Binding Specificity for Directed Nanocrystal Assembly. Nature 2000, 405 (6787), 665–668. \nKokan, Z.; Kirin, S. I. The Application of “Backdoor Induction” in Bioinspired Asymmetric Catalysis. RSC Adv. 2012, 2 (13), 5729.\n\nModule 7: Hierarchical Structures\n\nTaton, T. A. Boning up on Biology. Nature 2001, 412 (6846), 491–492.\nLi, K.; Li, C.; Li, H.; Li, M.; Song, Y. Designable Structural Coloration by Colloidal Particle Assembly: From Nature to Artificial Manufacturing. iScience 2021, 24 (2), 102121.\nPrabhu, D. D.; Aratsu, K.; Kitamoto, Y.; Ouchi, H.; Ohba, T.; Hollamby, M. J.; Shimizu, N.; Takagi, H.; Haruki, R.; Adachi, S.-I.; Yagai, S. Self-Folding of Supramolecular Polymers into Bioinspired Topology. Sci. Adv. 2018, 4 (9).\nAvinash, M. B.; Raut, D.; Mishra, M. K.; Ramamurty, U.; Govindaraju, T. Bioinspired Reductionistic Peptide Engineering for Exceptional Mechanical Properties. Sci. Rep. 2015, 5 (1), 1–8.\nJehle, F.; Fratzl, P.; Harrington, M. J. Metal-Tunable Self-Assembly of Hierarchical Structure in Mussel-Inspired Peptide Films. ACS Nano 2018, 12 (3), 2160–2168.\nReal-life Problems\nLanger, R. Biomaterials: Status, Challenges, and Perspectives. AIChE J. 2000, 46 (7), 1286–1289.\nBioinspired Materials and Technology\nTan, J.; Saltzman, W. M. Biomaterials with Hierarchically Defined Micro- and Nanoscale Structure. Biomaterials 2004, 25 (17), 3593–3601.\nLee, T.; Aksay, I. A. Hierarchical Structure−Ferroelectricity Relationships of Barium Titanate Particles. Cryst. Growth Des. 2001, 1 (5), 401–419.\nLibanori, R.; Münch, F. H. L.; Montenegro, D. M.; Studart, A. R. Hierarchical Reinforcement of Polyurethane-Based Composites with Inorganic Micro- and Nanoplatelets. Compos. Sci. Technol. 2012, 72 (3), 435–445.\nChen, R.; Liu, J.; Yang, C.; Weitz, D. A.; He, H.; Li, D.; Chen, D.; Liu, K.; Bai, H. Transparent Impact-Resistant Composite Films with Bioinspired Hierarchical Structure. ACS Appl. Mater. Interfaces 2019, 11 (26), 23616–23622.\nFang, J.; Gu, J.; Liu, Q.; Zhang, W.; Su, H.; Zhang, D. Three-Dimensional CdS/Au Butterfly Wing Scales with Hierarchical Rib Structures for Plasmon-Enhanced Photocatalytic Hydrogen Production. ACS Appl. Mater. Interfaces 2018, 10 (23), 19649–19655.\nCao, S. C.; Liu, J.; Zhu, L.; Li, L.; Dao, M.; Lu, J.; Ritchie, R. O. Nature-Inspired Hierarchical Steels. Sci. Rep. 2018, 8 (1), 1–7.\nBouville, F.; Maire, E.; Meille, S.; Van de Moortèle, B.; Stevenson, A. J.; Deville, S. Strong, Tough and Stiff Bioinspired Ceramics from Brittle Constituents. Nat. Mater. 2014, 13 (5), 508–514.\n\nModule 8: How Can the Lessons be Applied to Your Research or Interest?\nOpen Discussion\n\nMid Term and Final Term\nRen, J.; Liu, Q.; Pei, Y.; Wang, Y.; Yang, S.; Lin, S.; Chen, W.; Ling, S.; Kaplan, D. L. Bioinspired Energy Storage and Harvesting Devices. Adv. Mater. Technol. 2021, 6 (9).\nKatiyar, N. K.; Goel, G.; Hawi, S.; Goel, S. Nature-Inspired Materials: Emerging Trends and Prospects. NPG Asia Mater. 2021, 13 (1), 1–16."}, "selfCompiledRate": {"ch": "0", "en": "0"}, "instructMethod": {"ch": "講授\n研討\n\n個別指導", "en": ["Lecture", "Seminar", "", "Individual Instruction"]}, "gradMethod": {"ch": "總共有 7 次報告，每次報告占 10％ 的成績。還會有一個 20 分鐘的期中報告，針對特殊主題，該報告占 15％ 的成績。此外，期末還需提交一篇論文及報告，主題也需針對特殊主題，這部分占 15％ 的成績。", "en": "“There will be a total of 7 presentations, and each presentation is worth 10 ％.  There will be a 20-min Midterm Presentation on a special topic which is worth 15 ％.  There will also be a Final Term Paper and Presentation on a special topic of 15 ％.“"}, "officeHour": {"ch": "Thursdays 9:00 a.m.– 12:00 p.m.", "en": "Thursdays 9:00 a.m.– 12:00 p.m."}, "teachWeeks": {"ch": "18", "en": "18"}, "flexDiscription": {"ch": "", "en": ""}, "domain": {"ch": "尖端有機及高分子材料", "en": "尖端有機及高分子材料"}, "map": {"ch": [{"competencies": "專業領域知識", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "學術研究", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "專業論文撰寫", "rating": "(5)非常高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "創新思考", "rating": "(3)普通", "assesments": ["口頭報告/口試"]}, {"competencies": "協調整合", "rating": "(5)非常高", "assesments": ["口頭報告/口試"]}, {"competencies": "國際視野", "rating": "(3)普通", "assesments": ["口頭報告/口試"]}, {"competencies": "領導管理", "rating": "(5)非常高", "assesments": ["口頭報告/口試"]}, {"competencies": "終身學習", "rating": "(2)低", "assesments": ["口頭報告/口試"]}], "en": [{"competencies": "Professional knowledge", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Academic research", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Professional writing", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Innovative thinking", "rating": "(3)Medium", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Coordination and integration", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Worldwide Views", "rating": "(3)Medium", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Leadership and ManagementLeadership and management", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Lifelong learning", "rating": "(2)Low", "assesments": ["Presentation/Oral Exam"]}]}, "assignCriteria": {"ch": [], "en": []}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 0}, "stuGrade": {"doctor": {}, "master": {}, "bachelor": {}}, "stus": [{"serial": "1", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "2", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "3", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "4", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "5", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "6", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "7", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "8", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "9", "stunum": "11*******", "department": "化學工程與材料工程學系碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "10", "stunum": "11*******", "department": "材料科學與工程研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}]}