{"serial": "34031", "department_serial": 30, "code": "CH8097", "class": "*", "name": {"en": "Bio-inspired Materials", "ch": "生物啟發材料"}, "notice": {"en": "", "ch": "研究所領域分類：材料類"}, "instructor": {"en": ["Lee, Tu"], "ch": ["李度"]}, "credits": 3, "time_loc": [{"time": {"week": 5, "session": ["2", "3", "4"]}, "loc": {"building": "E", "room": "360"}}], "isRequired": false, "isFullSem": false, "MaxStu": 65, "department": {"ch": "化學工程與材料工程學系", "en": "Department of  Chemical Engineering"}, "system": {"ch": "碩博同修", "en": "Master/Doctoral Programme"}, "language": {"ch": "英語", "en": "English"}, "card": {"ch": "部份使用", "en": "Optional"}, "assigned": 0, "selected": 0, "remark": {"ch": "研究所領域分類：材料類", "en": ""}, "goal": {"ch": "本課所用教材以英文為主，進而提高學生閱讀能力，並且培養學生具有：(1) 國際觀(瞭解現在最熱寧的領域，閱讀國外期刊) (2) 整合能力(自我閱讀英文論文，做出有條理的簡報) (3) 表達能力(在報告時會依簡報設計，參考文獻，英文拼字，內容，流暢度，手勢，自信，發音，眼神交會，聲量，邏輯，思路清晰度，語調，深度及回答問題好壞來做評分。) (4) 創造力(是否把所學運用在自己研究上，能否把枯燥的題目變得生動) (5) 領導的能力(掌控完成報告所需時間，報告的品質管理，自訂報告的內容)。此外上課的文獻就生物啟發材料的五大特色，可分成八個單元，每個單元都涵蓋三部分：(1)生物啟發的特色，(2)生活中可以利用生物啟發材料來解決問題，(3)生物啟發材料的解決方法。學生通過對這八個單元所做的個人研讀，可以對生物啟發材料有更廣與更深的了解。希望學生能舉一反三，運用在自己的研究範疇。", "en": "“Biomaterials have been around for a long time.  They have evolved into many superb functional materials under the process of natural selection.  Therefore, using them as an inspirational source is very common to scientists.  Although many biomedical materials or active pharmaceutical ingredients are derived from natural products, only a few of the synthetic materials, composite materials and advanced functional materials based on bio-inspiration are discovered and designed in the areas of materials science and engineering.  It becomes more important than ever to investigate bio-inspired materials and technology nowadays.  We have collected more than 45 papers from different journals (ex: International Journal of Pharmaceutical, Journal of Physics D: Applied Physics, Nature and Science, etc.) in this course covering disciplines such as molecular biology, chemistry, physics, chemical engineering, polymers, semiconductors, optoelectronics and pharmaceutical engineering, investigating the materials structure from nanometer scale all the way to micron level.  We will devote our time to six important features in bio-inspiration: chirality, polymorphism, self-assembly, molecular recognition, patterning, and hierarchical structures, by bottom-up fabrication.\nAll teaching and reading materials are written in English.  Hopefully, the reading abilities of students will be elevated.  Students are expected to cultivate: (1) international views (i.e. by following the current trend in research and reading foreign journals), (2) integration skills (i.e. by studying the papers independently and preparing logical power-point presentations), (3) communication skills (i.e. the grading of presentation is based on presentation design, references, spellings, contents, fluency, gestures, confidence, punctuality, eye contact, voice level, logics, clarity, modulation, depth and answers to questions), (4) innovation (i.e. applying the knowledge on the research and turning a boring subject into an interesting topic), and (5) leadership (i.e. time management, spontaneity, presentation design).  The five key features of bio-inspiration are divided into eight modules, and each module is composed of three parts: (1) the uniqueness of bio-inspiration, (2) real-life problems which can be solved by bio-inspired materials and technology, and (3) solutions offered by bio-inspired materials and technology.  Thorough the personal study of these eight modules, students can gain understandings of bio-inspired materials and technology.  We hope students can eventually reason and think on their own, and to apply the insight in their own research areas.“"}, "outline": {"ch": "“Bioinspired Materials and Technology Fall 2021Host: Prof. Tu LeeTime: Fridays 9:00 – 11:50 a.m.Place: Engineering Building 1, E233This is an English speaking, intensive reading course. Biology or biochemistry background is NOT required. The course is divided into eight different modules (Table 1) and the reading assignments for each module is shown in references.Students are expected to read All assignments and to present of what they read in a 5 to 10-page power point format. Different specific presentation topics will be assigned in the class. There will be a total of 7 presentations (one presentation/module on average) for each student. Each presentation is worth 10 ％. There will be a 20-min Midterm Presentation on a special topic which is worth 15 ％. There will also be a Final Term Paper and Presentation on a special topic of 15 ％. The final decision on the topics of Midterm Presentation and Final Term Paper MUST be made by a thorough discussion between students and the professor before 11/12/2021 and 12/24/2021, respectively. The format of the presentation and the term paper will be announced in the class. Table 1. SyllabusWeek of Module09/17 Orientation09/24 110/02 1 10/09 210/15 210/22 310/29 311/05 411/12 411/19 No Class (TwIChE)11/26 Midterm Presentation12/03 512/10 512/17 612/24 612/31 No Class (Holiday)01/07 701/14 Final Term Paper ＆ Final Presentation“", "en": "“Bioinspired Materials and Technology Fall 2021Host: Prof. Tu LeeTime: Fridays 9:00 – 11:50 a.m.Place: Engineering Building 1, E233This is an English speaking, intensive reading course. Biology or biochemistry background is NOT required. The course is divided into eight different modules (Table 1) and the reading assignments for each module is shown in references.Students are expected to read All assignments and to present of what they read in a 5 to 10-page power point format. Different specific presentation topics will be assigned in the class. There will be a total of 7 presentations (one presentation/module on average) for each student. Each presentation is worth 10 ％. There will be a 20-min Midterm Presentation on a special topic which is worth 15 ％. There will also be a Final Term Paper and Presentation on a special topic of 15 ％. The final decision on the topics of Midterm Presentation and Final Term Paper MUST be made by a thorough discussion between students and the professor before 11/12/2021 and 12/24/2021, respectively. The format of the presentation and the term paper will be announced in the class. Table 1. SyllabusWeek of Module09/17 Orientation09/24 110/02 1 10/09 210/15 210/22 310/29 311/05 411/12 411/19 No Class (TwIChE)11/26 Midterm Presentation12/03 512/10 512/17 612/24 612/31 No Class (Holiday)01/07 701/14 Final Term Paper ＆ Final Presentation“"}, "textbook": {"ch": "“Reading AssignmentsModule 1: Why Do We Need Bio-inspired Materials and Technology?James Wei, Molecular Structure and Property: Product Engineering, Ind. Eng. Chem. Res., 41 (2002) 1917-1919. Ivana Soten and Geoffrey A. Ozin, New Directions in Self-Assembly: Materials Synthesis Over “All” Length Scales, Current Opinion in Colloid ＆ Interface Science (1999) 4: 325-337Branden and Tooze – Chapters 1- 5Module 2: Chirality ControlJohn McMurray, Organic Chemistry – Ch 8Lia Addadi and Steve Weiner, Biomineralization: Crystals, Asymmetry and Life, Nature (2001) 411: 754-755.Avital Levy-Lior, Steve Weiner and Lia Addadi, Achiral Calcium-Oxalate Crystals with Chiral Morphology from the Leaves of Some Solanacea Plants, Hel. Chim. Acta (2003) 86: 4007 – 4017.Real-life ProblemsA. R. Fassihi, Racemates and Enantiomers in Drug Development, Int. J. Pharm., (1993) 92: 1-14.Geoff G. Z. Zhang, Sophia Y. L. Paspal, Raj Suryanarayanan and David J. W. Grant, Racemic Species of Sodium Ibuprofen: Characterization and Polymorphic Relationship, J. Pharm. Sci., (2003) 92(7): 1356-1366.Sonja Sioncke, Thierry Verbiest, Andre Persoons, Second-order Nonlinear Optical Properties of Chiral Materials, Mater. Sci. Eng., R42 (2003) 115-155.L. Addadi, S. Weinstein, E. Gati, I. Weissbuch and M. Lahav, Resolution of Conglomerates with the Assistance of Tailor-made Impurities.  Generality and Mechanistic Aspects of the “Rule of Reversal”.  A New Method for Assignment of Absolute Configuration, J. Am. Chem. Soc., 104 (1982) 4610-4617.Bioinspired Materials and TechnologyC. A. Orme, A. Noy, A. Wierzbickl, M. T. Mc Bride, M. Grantham, H. H. Teng, P. M. Dove and J. J. DeYoreo, Formation of Chiral Morphologies through Selective Binding of Amino Acids to Calcite Surface Steps, Nature (2001) 411: 775-779.Xin Huang, Chao Li, Siguang Jiang, Xuesong Wang, Baowen Zhang and Minghua Liu, Self-Assembled Spiral Nanoarchitecture and Supramolecular Chirality in Langmuir-Blodgett Films of an Achiral Amphiphilic Barbituric Acid, J. Am. Chem. Soc., 126 (2004) 1322-1323.Module 3: Polymorphism ControlCharlotte M. Zaremba, Angela M. Belcher, Monika Fritz, Youli Li, Stephen Mann, Paul K. Hansma, Daniel E. Morse, James S. Speck and Galen D. Stucky, Critical Transitions in the Biofabrication of Abalone Shells and Plat Pearls, Chem. Mater. (1996) 8: 679-690.Katie E. Gunnison, Mehmet Sarikaya, Jun Liu and Ilhan A. Aksay, Structure-Mechanical Property Relationships in a Biological Ceramic-Polymer Composite: Nacre, Mat. Res. Soc. Symp. Proc. (1992) 255: 171-183.Real-life ProblemsZhijian Chen, Kenji Ogino, Seizo Miyata, Youmei Lu and Toshiyuki Watanabe, The Pure White Light Emission from Three-Layer Electroluminescent Device, J. Phys. D: Appl. Phys., 35 (2002) 742-746.Peter Fryer and Kerstin Pinschower, The Materials Science of Chocolate, MRS Bulletin (December 2000): 25-29.Kiyotaka Sato, Polymorphic Transformation in Crystal Growth, Phys. D: Appl. Phys., 26 (1993) B77-B84.Bioinspired Materials and TechnologyAbraham Ulman, Formation and Structure of Self-Assembled Monolayers, Chem. Rev., 96 (1996) 1533-1554.Alfred Y. Lee, Abraham Ulman and Allan S. Myerson, Crystallization of Amino Acids on Self-assembled Monolayers of Rigid Thiols on Gold, Langmuir, (2002) 18: 5886-5898.Tu Lee, Crystal Nucleating Chip for Forming Crystals and Determining Crystal Polymorphism and Crystal Habit, (USA) U. S. Pat. Appl. Publ. (2003), 15 pp. US 20030068252 A1.Module 4: Nanosized Bio-materialsBauerlein – Chapters 1, 2, 5, 6, 8Chang Du, Giuseeppe Falini, Simona Fermani, Christopher Abbott and Janet Moradian-Oldak, Supramolecular Assembly of Amelogenin Nanospheres into Birefrigent Microribbons, Science (2005) 307: 1450-1454.Arthur Veis, A Window on Biomineralization, Science (2005) 307: 1419-1420.Real-life ProblemsRichard W. Siegel, Exploring Mesoscopia: The Bold New World of Nanostructures, Physics Today, (1993) 64-68.A. P. Alivisatos, Semiconductor Clusters, Nanocrystals and Quantum Dots, Science (1996) 271: 933-937.Jing Shi, S. Gider, K. Babcock and D. D. Awschalom, Magnetic Clusters in Molecular Beams, Metals and Semiconductors, Science (1996) 271: 937-941.Bioinspired Materials and TechnologyStephen Mann and Robert J. P. Williams, Precipitation within Unilamellar Vesicles. Part 1. Studies of Silver (I) Oxide Formation, J. Chem. Soc. Dalton Trans. (1983) 311 –316.Victor F. Puntes, Kannan M. Krishnan and A. Paul Alivisatos, Colloidal Nanocrystal Shape and Size Control: The Case of Cobalt, Science (2001) 291: 2115-2117.Stephen Mann, John P. Hannington ＆ R. J. P. Williams, Phospholipid Vesicles as a Model System for Biomineralization, Nature, (1986) 324: 565-567.Trevor Douglas, Erica Strable, Deborah Willits, Abdelaziz Aitouchen, Matthew Libera and Mark Young, Protein Engineering of a Viral Cage for Constrained Nanomaterials Synthesis, Adv. Mater. (2002) 14(6): 415-418.Module 5: Patterned Bio-materialsBauerlein – Chapters 9, 10, 11Real-life ProblemsRobert Langer, Drugs on Target, Science, (2001) 239: 58-59.H. Gleiter, Nanostructured Materials: State of the Art and Perspectives, Nanostructures Materials, (1995) 6: 3-14.Felix A. Buot, Mesoporous Physics and Nanoelectronics: Nanoscience and Nanotechnology, Physics Reports (Review Section of Physics Letters) (1993) 234 (2 ＆ 3): 73-174.Tommie W. Kelley, Paul F. Baude, Chris Gerlach, David E. Ender, Dawn Muyres, Michael A. Haase, Dennis E. Vogel and Steven D. Thesis, Recent Progress in Organic Electronics: Materials, Devices and Processes, Chem. Mater. (2004) 16: 4413-4422.Bioinspired Materials and TechnologyAlan Sellinger, Pilar M. Weiss, Anh Nguyen, Yunfeng Lu, Roger A. Assink, Weiliang Gong and C. Jeffrey Brinker, Continuous Self-Assembly of Organic-Inorganic Nanocomposite Coatings that Mimic Nacre, Nature (1998) 394: 256-260.Joanna Aizenberg, Crystallization in Patterns: A Bio-Inspired Approach, Adv. Mater. (2004) 16(15): 1295-1302.Shuang Li, Cori Demmelmaier, Mikhail Itkis, Zhiming Liu, Robert C. Haddon and Yushan Yan, Micropatterned Oriented Zeolite Monolayer Films by Direct In Situ Crystallization, Chem. Mater. (2003) 15: 2687-2689.Module 6: Molecular RecognitionsLawrence J. Stern, Jerry H. Brown, Theodore S. Jardetzky, Joan C. Gorga, Robert G. Urban, Jack L. Strominger and Don C. Wiley, Crystal Structure of the Human Class II MHC Protein HLA-DR1 Complexed with an Influenza Virus Peptide, Nature (1994) 368: 215-221.Real-life ProblemsFodor, S. P. A.; Leighton Read, J.; Pirrung, M. C.; Stryer, L.; Lu, A. T.; and Solas, D., Light-Directed Spatially Addresable Parallel Chemical Synthesis, Science (1991) 251: 767-773.Bioinspired Materials and TechnologyBorje Sellergren, Imprinted Polymers with Memory for Small Molecules, Proteins or Crystals, Angew. Chem. Int. Ed. (2000) 39(6): 1031-1037.Sandra R. Whaley, D. S. English, Evelyn L. Hu, Paul F. Barbara and Angela M. Belcher, Selection of Peptides with Semiconductor Binding Specificity for Directed Nanocrystal Assembly, Nature (2000) 405: 665- 668Module 7: Hierarchical StructuresT. Andrew Taton, Nanotechnology: Boning Up on Biology, Nature, (2001) 412: 491-492.Jun Liu, Mehmet Sarikaya and Ilhan A. Aksay, A Hierarchically Structured Model Composite: A TEM Study of the Hard Tissue of Red Abalone, Mat. Res. Soc. Symp. Proc., (1992) 255: 9-17.Real-life ProblemsRobert Langer, Biomaterials: Status, Challenges and Perspective, AIChE Journal, (2000) 46(7): 1286-1289.“", "en": "“Reading AssignmentsModule 1: Why Do We Need Bio-inspired Materials and Technology?James Wei, Molecular Structure and Property: Product Engineering, Ind. Eng. Chem. Res., (2002) 41: 1917-1919. [A1]Ivana Soten and Geoffrey A. Ozin, New Directions in Self-Assembly: Materials Synthesis Over “All” Length Scales, Current Opinion in Colloid ＆ Interface Science (1999) 4: 325-337. [B1]Branden and Tooze – Chapters 1- 5Module 2: Chirality ControlJohn McMurray, Organic Chemistry – Ch 8Lia Addadi and Steve Weiner, Biomineralization: Crystals, Asymmetry and Life, Nature (2001) 411: 754-755. [C1]Avital Levy-Lior, Steve Weiner and Lia Addadi, Achiral Calcium-Oxalate Crystals with Chiral Morphology from the Leaves of Some Solanacea Plants, Hel. Chim. Acta (2003) 86: 4007 – 4017.Real-life ProblemsA. R. Fassihi, Racemates and Enantiomers in Drug Development, Int. J. Pharm., (1993) 92: 1-14. [D1]Geoff G. Z. Zhang, Sophia Y. L. Paspal, Raj Suryanarayanan and David J. W. Grant, Racemic Species of Sodium Ibuprofen: Characterization and Polymorphic Relationship, J. Pharm. Sci., (2003) 92: 1356-1366. [E1]Sonja Sioncke, Thierry Verbiest, Andre Persoons, Second-order Nonlinear Optical Properties of Chiral Materials, Mater. Sci. Eng., (2003) R42: 115-155.L. Addadi, S. Weinstein, E. Gati, I. Weissbuch and M. Lahav, Resolution of Conglomerates with the Assistance of Tailor-made Impurities.  Generality and Mechanistic Aspects of the “Rule of Reversal”.  A New Method for Assignment of Absolute Configuration, J. Am. Chem. Soc., (1982) 104: 4610-4617. [A2]Bioinspired Materials and TechnologyC. A. Orme, A. Noy, A. Wierzbickl, M. T. Mc Bride, M. Grantham, H. H. Teng, P. M. Dove and J. J. DeYoreo, Formation of Chiral Morphologies through Selective Binding of Amino Acids to Calcite Surface Steps, Nature (2001) 411: 775-779. [B2]Xin Huang, Chao Li, Siguang Jiang, Xuesong Wang, Baowen Zhang and Minghua Liu, Self-Assembled Spiral Nanoarchitecture and Supramolecular Chirality in Langmuir-Blodgett Films of an Achiral Amphiphilic Barbituric Acid, J. Am. Chem. Soc., (2004) 126: 1322-1323. [C2]Module 3: Polymorphism ControlCharlotte M. Zaremba, Angela M. Belcher, Monika Fritz, Youli Li, Stephen Mann, Paul K. Hansma, Daniel E. Morse, James S. Speck and Galen D. Stucky, Critical Transitions in the Biofabrication of Abalone Shells and Plat Pearls, Chem. Mater. (1996) 8: 679-690. [D2]Katie E. Gunnison, Mehmet Sarikaya, Jun Liu and Ilhan A. Aksay, Structure-Mechanical Property Relationships in a Biological Ceramic-Polymer Composite: Nacre, Mat. Res. Soc. Symp. Proc. (1992) 255: 171-183.Real-life ProblemsZhijian Chen, Kenji Ogino, Seizo Miyata, Youmei Lu and Toshiyuki Watanabe, The Pure White Light Emission from Three-Layer Electroluminescent Device, J. Phys. D: Appl. Phys., (2002) 35: 742-746.Peter Fryer and Kerstin Pinschower, The Materials Science of Chocolate, MRS Bulletin (December 2000): 25-29. [E2]Kiyotaka Sato, Polymorphic Transformation in Crystal Growth, Phys. D: Appl. Phys.,  (1993) 26: B77-B84.Bioinspired Materials and TechnologyAbraham Ulman, Formation and Structure of Self-Assembled Monolayers, Chem. Rev., (1996) 96: 1533-1554. [A3]Alfred Y. Lee, Abraham Ulman and Allan S. Myerson, Crystallization of Amino Acids on Self-assembled Monolayers of Rigid Thiols on Gold, Langmuir, (2002) 18: 5886-5898. [B3]Tu Lee, Crystal Nucleating Chip for Forming Crystals and Determining Crystal Polymorphism and Crystal Habit, (USA) U. S. Pat. Appl. Publ. (2003), 15 pp. US 20030068252 A1.Module 4: Nanosized Bio-materialsBauerlein – Chapters 1, 2, 5, 6, 8Chang Du, Giuseeppe Falini, Simona Fermani, Christopher Abbott and Janet Moradian-Oldak, Supramolecular Assembly of Amelogenin Nanospheres into Birefrigent Microribbons, Science (2005) 307: 1450-1454.Arthur Veis, A Window on Biomineralization, Science (2005) 307: 1419-1420. [C3]Real-life ProblemsRichard W. Siegel, Exploring Mesoscopia: The Bold New World of Nanostructures, Physics Today, (1993) 64-68. [C3]A. P. Alivisatos, Semiconductor Clusters, Nanocrystals and Quantum Dots, Science (1996) 271: 933-937. [D3]Jing Shi, S. Gider, K. Babcock and D. D. Awschalom, Magnetic Clusters in Molecular Beams, Metals and Semiconductors, Science (1996) 271: 937-941. [E3]Bioinspired Materials and TechnologyStephen Mann and Robert J. P. Williams, Precipitation within Unilamellar Vesicles. Part 1. Studies of Silver (I) Oxide Formation, J. Chem. Soc. Dalton Trans. (1983) 311 –316. [A4]Victor F. Puntes, Kannan M. Krishnan and A. Paul Alivisatos, Colloidal Nanocrystal Shape and Size Control: The Case of Cobalt, Science (2001) 291: 2115-2117.Stephen Mann, John P. Hannington ＆ R. J. P. Williams, Phospholipid Vesicles as a Model System for Biomineralization, Nature, (1986) 324: 565-567. [B4]Trevor Douglas, Erica Strable, Deborah Willits, Abdelaziz Aitouchen, Matthew Libera and Mark Young, Protein Engineering of a Viral Cage for Constrained Nanomaterials Synthesis, Adv. Mater. (2002) 14: 415-418.Module 5: Patterned Bio-materialsBauerlein – Chapters 9, 10, 11Real-life ProblemsRobert Langer, Drugs on Target, Science, (2001) 239: 58-59.H. Gleiter, Nanostructured Materials: State of the Art and Perspectives, Nanostructures Materials, (1995) 6: 3-14. [C4]Felix A. Buot, Mesoscopic  Physics and Nanoelectronics: Nanoscience and Nanotechnology, Physics Reports (Review Section of Physics Letters) (1993) 234 (2 ＆ 3): 73-174. [D4]Tommie W. Kelley, Paul F. Baude, Chris Gerlach, David E. Ender, Dawn Muyres, Michael A. Haase, Dennis E. Vogel and Steven D. Thesis, Recent Progress in Organic Electronics: Materials, Devices and Processes, Chem. Mater. (2004) 16: 4413-4422. [E4]Bioinspired Materials and TechnologyAlan Sellinger, Pilar M. Weiss, Anh Nguyen, Yunfeng Lu, Roger A. Assink, Weiliang Gong and C. Jeffrey Brinker, Continuous Self-Assembly of Organic-Inorganic Nanocomposite Coatings that Mimic Nacre, Nature (1998) 394: 256-260. [A5]Joanna Aizenberg, Crystallization in Patterns: A Bio-Inspired Approach, Adv. Mater. (2004) 16: 1295-1302. [B5]Shuang Li, Cori Demmelmaier, Mikhail Itkis, Zhiming Liu, Robert C. Haddon and Yushan Yan, Micropatterned Oriented Zeolite Monolayer Films by Direct In Situ Crystallization, Chem. Mater. (2003) 15: 2687-2689. [C5]Module 6: Molecular RecognitionsLawrence J. Stern, Jerry H. Brown, Theodore S. Jardetzky, Joan C. Gorga, Robert G. Urban, Jack L. Strominger and Don C. Wiley, Crystal Structure of the Human Class II MHC Protein HLA-DR1 Complexed with an Influenza Virus Peptide, Nature (1994) 368: 215-221. [D5]Real-life ProblemsFodor, S. P. A.; Leighton Read, J.; Pirrung, M. C.; Stryer, L.; Lu, A. T.; and Solas, D., Light-Directed Spatially Addresable Parallel Chemical Synthesis, Science (1991) 251: 767-773. [E5]Bioinspired Materials and TechnologyBorje Sellergren, Imprinted Polymers with Memory for Small Molecules, Proteins or Crystals, Angew. Chem. Int. Ed. (2000) 39(6): 1031-1037. [A6]Sandra R. Whaley, D. S. English, Evelyn L. Hu, Paul F. Barbara and Angela M. Belcher, Selection of Peptides with Semiconductor Binding Specificity for Directed Nanocrystal Assembly, Nature (2000) 405: 665- 668. [B6]Module 7: Hierarchical Structures(1) T. Andrew Taton, Nanotechnology: Boning Up on Biology, Nature, (2001) 412: 491-492. [C6]Jun Liu, Mehmet Sarikaya and Ilhan A. Aksay, A Hierarchically Structured Model Composite: A TEM Study of the Hard Tissue of Red Abalone, Mat. Res. Soc. Symp. Proc., (1992) 255: 9-17. [D6]Recent articles published in our research group [E6], [A7]“"}, "selfCompiledRate": {"ch": "0", "en": "0"}, "instructMethod": {"ch": "講授\n研討\n\n個別指導", "en": ["Lecture", "Seminar", "", "Individual Instruction"]}, "gradMethod": {"ch": "“There will be a total of 7 presentations, and each presentation is worth 10 ％.  There will be a 20-min Midterm Presentation on a special topic which is worth 15 ％.  There will also be a Final Term Paper and Presentation on a special topic of 15 ％.“", "en": "“There will be a total of 7 presentations, and each presentation is worth 10 ％.  There will be a 20-min Midterm Presentation on a special topic which is worth 15 ％.  There will also be a Final Term Paper and Presentation on a special topic of 15 ％.“"}, "officeHour": {"ch": "Thursdays 9:00 a.m.– 12:00 p.m.", "en": "Thursdays 9:00 a.m.– 12:00 p.m."}, "teachWeeks": {"ch": "18", "en": "18"}, "flexDiscription": {"ch": "", "en": ""}, "domain": {"ch": "尖端有機及高分子材料", "en": "尖端有機及高分子材料"}, "map": {"ch": [{"competencies": "專業領域知識", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "學術研究", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "專業論文撰寫", "rating": "(5)非常高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "創新思考", "rating": "(3)普通", "assesments": ["口頭報告/口試"]}, {"competencies": "協調整合", "rating": "(5)非常高", "assesments": ["口頭報告/口試"]}, {"competencies": "國際視野", "rating": "(3)普通", "assesments": ["口頭報告/口試"]}, {"competencies": "領導管理", "rating": "(5)非常高", "assesments": ["口頭報告/口試"]}, {"competencies": "終身學習", "rating": "(2)低", "assesments": ["口頭報告/口試"]}], "en": [{"competencies": "Professional knowledge", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Academic research", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Professional writing", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Innovative thinking", "rating": "(3)Medium", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Coordination and integration", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Worldwide Views", "rating": "(3)Medium", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Leadership and ManagementLeadership and management", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam"]}, {"competencies": "Lifelong learning", "rating": "(2)Low", "assesments": ["Presentation/Oral Exam"]}]}, "assignCriteria": {"ch": [], "en": []}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 0}, "stuGrade": {"doctor": {}, "master": {}, "bachelor": {}}, "stus": []}