{"serial": "14014", "code": "PDA024", "class": "*", "name": {"en": "Religious Philosophy I", "ch": "宗教哲學I"}, "instructor": {"en": "Luh, Jing-Jong", "ch": "陸敬忠"}, "department": {"en": "Master of Philosophy", "ch": "哲學研究所碩士班"}, "system": {"en": "Master Programme (Adult Learning)", "ch": "碩士在職專班"}, "time_loc": {"en": [{"time": {"week": 2, "period": ["A"]}, "loc": "Humanities & Social Sciences Building 322"}, {"time": {"week": 2, "period": ["B"]}, "loc": "Humanities & Social Sciences Building 322"}, {"time": {"week": 2, "period": ["C"]}, "loc": "Humanities & Social Sciences Building 322"}], "ch": [{"time": {"week": 2, "period": ["A"]}, "loc": "人文社會科學大樓", "room": "322"}, {"time": {"week": 2, "period": ["B"]}, "loc": "人文社會科學大樓", "room": "322"}, {"time": {"week": 2, "period": ["C"]}, "loc": "人文社會科學大樓", "room": "322"}]}, "required": false, "credits": "3", "isFulSem": false, "lang": {"en": "Chinese", "ch": "國語"}, "crsCard": {"en": "None", "ch": "不使用"}, "max_stu": -1, "assigned": 0, "selected": 17, "remark": {"en": "", "ch": ""}, "goal": {"en": "Western philosophy of religion and religious studies have transited through the stages of traditional metaphysics and modern religious sciences, and have transferred from phenomenology of philosophy to the third stage: hermeneutics of religion. After an introductory presentation to traditional philosophy of religion and modern religious studies, this course will systemically reveal and develop the fundamental theories of hermeneutics, and through the introduction of relevant basic texts, initiate students into the palace of philosophy of religion and hermeneutics at the same time.", "ch": "西方宗教哲學及宗教研究經由傳統形上學及現代宗教學兩階段後已經由宗教現象學進入第三階段：宗教詮釋學。本課程在導論性地介紹傳統宗教哲學及現代宗教學後，將體系性地揭示與展開宗教詮釋學之基本理論，並且藉由相關基要文本之導讀，引介學子同時進入宗教哲學及詮釋學之殿堂。"}, "content": {"en": "This course will first introduce a new typology and development history of philosophy of religion in the West from paradigm of the traditional metaphysical philosophy of religion through the rise of paradigm of the modern religious sciences and its transformation to phenomenology of religion. Through the above, the third phase and paradigm can be initiated: hermeneutics of religion. Then, after essentially presenting the basic theories in the contemporary hermeneutic turn and its systemic meta-theory, it can also systemically induct the theoretical concepts and practical applications of hermeneutics of religion. In this part of the discourse, on the one hand, this course will use the reading of classic texts to orientate students enter the spiritual dimension of religion and the reflections about it, such as the ideas of religious belief objects and subjects, and on the other hand, the religious practice dimension involved in the systemic hermeneutics of religion, In the dimension, issues such as religious experience and ethics will be specifically discussed.", "ch": "本課程首先將透過一種嶄新的宗教哲學類型學及發展史鋪陳地介紹西方從傳統形上學式宗教哲學典範經由現代宗教學典範之興起與其轉型至宗教現象學，而引進第三期典範：宗教詮釋學。接著在本質性地導論出當代詮釋學轉向中的基本理論以及其體系性後設理論後，進而能體系性地呈現宗教詮釋學基本構思及實際運用。在這部分的研討，本課程一方面會以經典文本之導讀使學子進入其宗教精神向度之省思如關於宗教信仰對象及主體等觀念，另方面會在體系性宗教詮釋學所涉及宗教實踐向度中具體討論如宗教經驗及倫理等議題。\n1.宗教哲學導論I：基本問題\n2.宗教哲學導論II：基本概念\n3.西方宗教哲學生成發展史I:從傳統形上學至宗教科學\n4.西方宗教哲學生成發展史II:從宗教現象學至宗教詮釋學\n5. 體系性詮釋學導論I：從哲學詮釋學至體系性詮釋學\n6. 體系性詮釋學導讀I：哲學詮釋學經典文本選讀\n6. 體系性詮釋學導論II：基設，理論，模式\n7. 體系性詮釋學導讀II：體系性詮釋學文本選讀\n8. 宗教詮釋學導論I: 基本理論\n9. 宗教詮釋學導讀I: 文本選讀\n10. 宗教詮釋學導論II:基本範疇\n11. 宗教詮釋學導讀II:文本選讀\n12. 宗教詮釋學主題I：宗教信仰對象\n13. 宗教詮釋學主題導讀I：文本選讀\n14. 宗教詮釋學主題II：宗教信仰主體\n15. 宗教詮釋學主題導讀II：文本選讀\n16. 宗教詮釋學主題III：宗教經驗\n17. 宗教詮釋學主題IV：宗教倫理\n18. 開放性結論：體系性宗教詮釋學"}, "textbook": {"en": "Clack, Beverley. The philosophy of religion : a critical introduction, Cambridge : Polity, 2008 Clayton, John. Religions, reasons and Gods: essays in cross-cultural philosophy of religion, Cambridge, Cambridge University Press, 2006 Cornford, F.M. From Religion to Philosophy. New York: Harper ＆ Row Publishers, 1957. Donceel, Joseph F. An Introduction to a Philosophy of God. Notre Dame: Notre Dame Univ. Press, 1979. Gerson, Lloyd P. God and Greek Philosophy: Studies in the Early History of Natural Theology. London: Routledge, 1990. Drozdek, Adam. Greek Philosophers as Theologians: The Divine Arche. Aldershot: Ashgate, 2007 Guthrie, W.K.C. The Greeks and their Gods. Boston: Beacon Press, 1950. ________. The Religion and Mythology of the Greeks. Cambridge: Cambridge Univ. Press, 1964. Hick, John. Dialogues in the philosophy of religion, New York : Palgrave Macmillan, 2010 Disputed questions in theology and the philosophy of religion, New Haven : Yale University Press, 1993 God and the universe of faiths : essays in the philosophy of religion, Oxford : Oneworld, c1993 Hodgson, Peter C. Hegel and Christian Theology. A Reading of the Lectures on the Philosophy of Religion, Oxford :Oxford University Press, 2005 Jaeger, Werner. The Theology of Early Greek Philosophers. Oxford: Oxford Univ. Press, 1947. Merklinger, Philip M. Philosophy, theology, and Hegel‘s Berlin philosophy of religion, 1821-1827, Albany, N.Y. State University of New York Press, c1993 McCutcheon, Felicity. Religion within the Limits of Language Alone, Aldershot: Ashgate, 2001. Molnas, Thomas, Theists and Atheists: A Typology of Non-Belief. The Hague: Mouton Publishers, 1980. Murray, Michael J. An introduction to the philosophy of religion, Cambridge : Cambridge University Press, 2008 Ramsey, Ian T. Religious Language and Empirical Placing of Theological Phrases. New York: Macmillan, 1957. Renard, Henri. The Philosophy of God. Milwaukee: The Bruce Publishing Campany, 1951. Sweeney, Leo, S. J. Divine Infinity in Greek and Medieval Thought. Berlin: Peter Lang, 1992. Taliaferro, Charles. Contemporary philosophy of religion, Malden, Mass. : Blackwell, 1998 . ＆ Chad Meister. ed. Christian Philosophical Theology. Cambridge: Cambridge Univ. Press, 2010 Tillich, Paul. Writings in the philosophy of religion : Religionsphilosophische Schriften, Berlin ; New York : De Gruyter ; Berlin : Evangelisches Verlagswerk, 1987 Thiselton, Anthony C. A concise encyclopedia of the philosophy of religion, Grand Rapids, Mich. : Baker Academic, 2005 Thompson, Mel. Understand the philosophy of religion, Blacklick, OH : McGraw-Hill c2010 Yandell, Keith E. Philosophy of religion : a contemporary introduction, London ; New York : Routledge, 1999 A companion to philosophy of religion, Cambridge, Mass. : Blackwell Publishers, 1999, c1997 A dictionary of philosophy of religion, New York : Continuum, 2010 After the postsecular and the postmodern : new essays in continental philosophy of religion, Newcastle : Cambridge Scholars, c2011 Contemporary debates in the philosophy of religion, Malden, MA : Blackwell Pub., c2004 Continental philosophy and philosophy of religion, Dordrecht : Springer Science+Business Media B.V., 2011 New perspectives on Hegel‘s philosophy of religion, Albany : State University of New York Press, c1992 Kant‘s philosophy of religion reconsidered, Bloomington, Ind. : Indiana University Press, c1991 Oxford studies in philosophy of religion, Oxford; New York : Oxford University Press, 2008 Oxford studies in philosophy of religion. Volume 3, Oxford : Oxford University Press, 2011 Philosophy of religion : the big questions, Malden, Mass. : Blackwell Publishers, 1999 Philosophy of religion : a guide and anthology, Oxford ; New York : Oxford University Press, 2000 Philosophy of religion : a guide to the subject, London : Cassell, 1998 Philosophy of religion : classic and contemporary issues, Malden, MA : Blackwell Pub., 2008 Philosophy of religion in the 21st century, Houndmills, Basingstoke, Hampshire ; New York : Palgrave, 2001 Philosophy of religion : selected readings, Fort Worth : Harcourt Brace College Publishers, c1998 Philosophy of religion : toward a global perspective, Belmont, CA : Wadsworth Pub. Co., c1999 The Blackwell guide to the philosophy of religion, Oxford, UK ; Malden, MA : Blackwell Pub., 2005 The history of western philosophy of religion, vol. 1-5, Durham : Acumen, 2009 The Oxford Handbook of Philosophy of Religion, New York : Oxford University Press, 2005", "ch": "教科書： Louis Dupré著，傅佩榮譯: 《人的宗教向度》(《The Other Dimension》)，幼獅文化。 M. Rader 編，傅佩榮譯：《宗教哲學初探》，黎明。 劉小楓主編：《20世紀西方宗教哲學文選》，上海三聯。"}, "self_comp": {"en": "90%", "ch": "90%"}, "method": {"en": "Lecture Seminar Individual Instruction Others", "ch": "講授 研討 個別指導 其他"}, "grading": {"en": "In-Class and Active Participating: 50％; Final Report: 50％", "ch": "平時成績: 50％；期末成績:50％"}, "office_hr": {"en": "Wendsday, 12 pm to 14 pm", "ch": "週三下午十二至十四時"}, "teach_week": {"en": "18", "ch": "18"}, "flex_desc": {"en": "", "ch": ""}, "domain": {"en": "應用倫理學課程群 、 專業進階研究課程群", "ch": "應用倫理學課程群 、 專業進階研究課程群"}, "map": {"en": [{"competency": "ability to appreciate ideas and theories", "rate": "(5) Very High", "Assessments": "Research Report(printed on paper) ， Attendance/Performance ， Self Assessment/ Peer Assessment ， Others"}, {"competency": "ability to think critically", "rate": "(5) Very High", "Assessments": "Research Report(printed on paper) ， Attendance/Performance ， Self Assessment/ Peer Assessment ， Others"}, {"competency": "ability to interpret classical texts", "rate": "(3) Medium", "Assessments": "Research Report(printed on paper) ， Attendance/Performance"}, {"competency": "ability to apply theory to real world", "rate": "(5) Very High", "Assessments": "Research Report(printed on paper) ， Attendance/Performance ， Self Assessment/ Peer Assessment ， Others"}, {"competency": "ability to appreciate arts and humanities", "rate": "(4) High", "Assessments": "Research Report(printed on paper) ， Attendance/Performance ， Self Assessment/ Peer Assessment"}, {"competency": "ability to appreciate Chinese and foreign ideas", "rate": "(3) Medium", "Assessments": "Research Report(printed on paper) ， Attendance/Performance ， Self Assessment/ Peer Assessment"}], "ch": [{"competency": "理論觀念", "rate": "(5) 非常高", "Assessments": "專題研究報告(書面) ， 出席/課堂表現 ， 自我評量/同儕互評 ， 其他"}, {"competency": "批判思考", "rate": "(5) 非常高", "Assessments": "專題研究報告(書面) ， 出席/課堂表現 ， 自我評量/同儕互評 ， 其他"}, {"competency": "文獻解讀", "rate": "(3) 普通", "Assessments": "專題研究報告(書面) ， 出席/課堂表現"}, {"competency": "學理應用", "rate": "(5) 非常高", "Assessments": "專題研究報告(書面) ， 出席/課堂表現 ， 自我評量/同儕互評 ， 其他"}, {"competency": "人文素養", "rate": "(4) 高", "Assessments": "專題研究報告(書面) ， 出席/課堂表現 ， 自我評量/同儕互評"}, {"competency": "中外思想", "rate": "(3) 普通", "Assessments": "專題研究報告(書面) ， 出席/課堂表現 ， 自我評量/同儕互評"}]}, "asign_crite": {"en": ["Department:Master of Philosophy (Adult Learning) only."], "ch": ["系所:限哲學研究所碩士在職專班。"]}, "prelim_sel": 17, "gender": {"male": 3, "female": 14}, "stu_depart": {"en": {"Master of Philosophy (Adult Learning)": 17}, "ch": {"哲學研究所碩士在職專班": 17}}, "stu_grade": {"Bachelor": {}, "Master": {"2": 7, "1": 10}, "Doctor": {}}}