{"serial": "27006", "department_serial": 73, "code": "NS5072", "class": "*", "name": {"en": "Exercise training and cognitive ability", "ch": "獨立研究：運動訓練與認知能力"}, "notice": {"en": "", "ch": ""}, "instructor": {"en": ["Chang, Erik Chih-Hung"], "ch": ["張智宏"]}, "credits": 3, "time_loc": [{"time": {"week": 1, "session": ["2", "3", "4"]}, "loc": {"building": "S5", "room": "601"}}], "isRequired": false, "isFullSem": false, "MaxStu": -1, "department": {"ch": "認知神經科學研究所碩士班", "en": "Graduate Institute of Cognitive Neuroscience"}, "system": {"ch": "碩博同修", "en": "Master/Doctoral Programme"}, "language": {"ch": "國語", "en": "Chinese"}, "card": {"ch": "不使用", "en": "None"}, "assigned": 1, "selected": 1, "remark": {"ch": "", "en": ""}, "goal": {"ch": "本課程旨在探討身體運動與認知功能之間的密切關聯。學生將研究各種形式的運動訓練，包括有氧運動、阻力訓練以及協調性運動，如何影響記憶力、注意力、執行功能及整體心理健康。本課程將強調理解這些認知提升背後的生理和神經機制。此外，學生還將批判性地評估運動對不同年齡層（如兒童、成年人和老年人）認知能力的影響，並探討運動干預在促進認知表現和減緩認知衰退中的應用。\n\n通過理論學習、實證研究回顧以及提案或執行研究計劃，學生將全面了解如何有效地將運動訓練整合到認知健康促進和疾病預防策略中。", "en": "he aim of this course is to explore the intricate relationship between physical exercise and cognitive functioning. Students will investigate how various forms of exercise, ranging from aerobic training to resistance and coordination exercises, can influence cognitive abilities such as memory, attention, executive functions, and overall mental health. The course will emphasize understanding the underlying physiological and neurological mechanisms that contribute to these cognitive improvements. Additionally, students will critically evaluate the impact of exercise across different age groups, including children, adults, and the elderly, and discuss the implications for interventions aimed at enhancing cognitive performance and mitigating cognitive decline.\n\nThrough a combination of theoretical learning, empirical research review, and practical application, students will gain a comprehensive understanding of how exercise training can be effectively integrated into strategies for cognitive health promotion and disease prevention."}, "outline": {"ch": "第 1 週：課程介紹和學習計劃制定\n目標：制定個別化學習計劃。\n活動：\n- 與指導教師會面，討論課程期望。\n- 概述個人目標和課題中的優先關注領域。\n- 創建演示文稿、閱讀材料和實驗的時間表。\n提交物：提交一份學習計劃，概述每週目標和主要里程碑。\n第 2 週：基礎閱讀和文獻回顧\n目標：建立對運動與認知能力關係的基礎理解。\n活動：\n- 進行關鍵主題的文獻回顧，如神經可塑性和不同運動類型的認知效應。\n- 開始編制註釋書目。\n提交物：提交選定閱讀材料的列表並附上註釋。\n第 3 週：基本概念的初步報告\n目標：演示和討論基礎概念。\n活動：\n- 準備一個 10-15 分鐘的演示文稿，介紹運動的認知益處。\n- 包括文獻回顧中的關鍵發現。\n- 與同儕或指導教師進行問答環節。\n提交物：進行演示並提交演示文稿幻燈片。\n第 4 週：設計實驗計劃書\n目標：制定研究計劃，以探討運動對認知功能的影響。\n活動：\n- 回顧文獻中的現有實驗設計。\n- 撰寫包含假設、方法和預期結果的計劃書。\n提交物：提交初步研究計劃書草稿以供反饋。\n第 5 週：深入探討運動類型與認知成果\n目標：探討具體運動類型及其特有的認知影響。\n活動：\n- 聚焦於某一類運動（如有氧運動、阻力訓練或協調性運動）及其認知效應。\n- 更新文獻回顧，提供更詳細的研究發現。\n提交物：在註釋書目中增加一個深入的部分，專注於所選運動類型。\n第 6 週：首次實驗設計報告\n目標：展示研究計劃並收集反饋。\n活動：\n- 向同儕或指導教師展示實驗設計。\n- 根據反饋修改最終計劃書。\n提交物：提交修訂後的研究計劃書和演示文稿幻燈片。\n第 7 週：實施初步實驗\n目標：基於研究計劃進行初步實驗。\n活動：\n- 執行計劃中的小規模版本實驗。\n- 收集初步數據並確定任何必要的調整。\n提交物：提交初步研究報告，包括數據和觀察結果。\n第 8 週：回顧並綜合認知衰退的文獻\n目標：理解運動在預防認知衰退中的作用。\n活動：\n- 聚焦於研究運動干預在老年人群中的應用。\n- 綜合關鍵研究發現及其含義。\n提交物：撰寫有關運動對認知衰退影響的總結報告。\n第 9 週：期中檢查與進度報告\n目標：評估進度並根據需要調整學習計劃。\n活動：\n- 與指導教師會面進行期中回顧。\n- 討論挑戰和可能的學習計劃調整。\n提交物：提交反映成就和挑戰的進度報告。\n第 10 週：聚焦於心理健康與認知的閱讀\n目標：探索運動、心理健康和認知表現之間的聯繫。\n活動：\n- 選擇並回顧有關運動對心理健康影響的文章。\n- 討論心理健康改善如何促進認知增強。\n提交物：在註釋書目中添加一節總結這些發現。\n第 11 週：實驗數據收集與分析\n目標：進行主要實驗並分析數據。\n活動：\n- 執行完整規模的實驗設計。\n- 使用適當的統計方法進行初步數據分析。\n提交物：提交初步數據分析報告。\n第 12 週：第二次實驗結果報告\n目標：展示實驗的初步結果。\n活動：\n- 準備報告，討論實驗設計、數據收集和初步結果。\n- 進行關鍵討論。\n提交物：進行報告並提交幻燈片。\n第 13 週：進一步的數據分析與解釋\n目標：完成數據分析並開始解釋結果。\n活動：\n- 進行更高級的統計分析。\n- 開始起草最終報告中的討論部分。\n提交物：提交詳細的數據分析報告。\n第 14 週：同儕評審與反饋會議\n目標：獲得同儕對研究項目的反饋。\n活動：\n- 與同儕分享最終報告和討論部分的草稿。\n- 提供和接收建設性反饋。\n提交物：根據同儕反饋修訂報告。\n第 15 週：最終文獻回顧與整合\n目標：將新發現整合到對主題的整體理解中。\n活動：\n- 更新並完成註釋書目，納入最新文獻。\n- 反思實驗發現如何融入更廣泛的研究背景。\n提交物：提交最終註釋書目。\n第 16 週：最終研究結果報告\n目標：展示綜合的研究結果。\n活動：\n- 進行最終報告，總結整個研究項目。\n- 討論意涵、局限性和未來的研究方向。\n提交物：進行最終報告並提交完整的研究報告。\n第 17 週：最終報告提交與反思\n目標：提交最終研究報告並反思獨立研究的經驗。\n活動：\n- 完成並提交研究報告，包括所有部分（引言、方法、結果、討論和結論）。\n- 撰寫一篇反思文章，總結課程中的學習收穫。\n提交物：提交最終研究報告和反思文章。\n第 18 週：口頭報告與課程總結\n目標：口頭報告研究結果並討論整體課程經驗。\n活動：\n- 向同儕和指導教師進行研究結果的口頭報告。\n- 參加最終反思會議。\n- 討論與運動和認知相關的未來研究或職業發展方向。\n提交物：進行口頭報告並提交未來研究構想或職業目標的簡要綱要。", "en": "Week 1: Course Orientation and Study Plan Development\nObjective: Develop a personalized study plan.\nActivities:\n- Meet with the instructor to discuss course expectations.\n- Outline individual goals and preferred focus areas within the topic.\n- Create a timeline for presentations, readings, and experiments.\nDeliverables: Submit a study plan outlining weekly goals and major milestones.\nWeek 2: Foundational Readings and Literature Review\nObjective: Build a foundational understanding of the relationship between exercise and cognitive ability.\nActivities:\n- Conduct a literature review on key topics, such as neuroplasticity and the cognitive effects of different exercise types.\n- Begin compiling an annotated bibliography.\nDeliverables: Submit a list of selected readings with annotations.\nWeek 3: Initial Presentation on Basic Concepts\nObjective: Present and discuss foundational concepts.\nActivities:\n- Prepare a 10-15 minute presentation on the cognitive benefits of exercise.\n- Include key findings from the literature review.\n- Engage in a Q＆A session with peers or the instructor.\nDeliverables: Deliver the presentation and submit presentation slides.\nWeek 4: Designing an Experiment Proposal\nObjective: Develop a research proposal to investigate the effects of exercise on cognitive function.\nActivities:\n- Review existing experimental designs in the literature.\n- Draft a proposal including hypotheses, methods, and expected outcomes.\nDeliverables: Submit the initial research proposal draft for feedback.\nWeek 5: Deep Dive into Exercise Types and Cognitive Outcomes\nObjective: Explore specific types of exercise and their distinct cognitive impacts.\nActivities:\n- Focus on a specific type of exercise (e.g., aerobic, resistance, or coordination) and its cognitive effects.\n- Update the literature review with more detailed findings.\nDeliverables: Add an in-depth section to the annotated bibliography focused on the chosen exercise type.\nWeek 6: First Experimental Design Presentation\nObjective: Present the research proposal and gather feedback.\nActivities:\n- Present the experimental design to peers or the instructor.\n- Incorporate feedback into the final proposal.\nDeliverables: Submit revised research proposal and presentation slides.\nWeek 7: Implementation of Pilot Experiment\nObjective: Conduct a pilot experiment based on the research proposal.\nActivities:\n- Carry out a small-scale version of the proposed experiment.\n- Collect preliminary data and identify any necessary adjustments.\nDeliverables: Submit a brief report on the pilot study, including data and observations.\nWeek 8: Review and Synthesize Literature on Cognitive Decline\nObjective: Understand the role of exercise in preventing cognitive decline.\nActivities:\n- Focus on studies addressing exercise interventions in aging populations.\n- Synthesize key findings and implications.\nDeliverables: Write a summary report on the impact of exercise on cognitive decline.\nWeek 9: Mid-Semester Check-In and Progress Report\nObjective: Assess progress and adjust study plan as necessary.\nActivities:\n- Meet with the instructor for a mid-semester review.\n- Discuss challenges and potential adjustments to the study plan.\nDeliverables: Submit a progress report reflecting on accomplishments and challenges.\nWeek 10: Focused Readings on Mental Health and Cognition\nObjective: Explore the link between exercise, mental health, and cognitive performance.\nActivities:\n- Select and review articles on the effects of exercise on mental health.\n- Discuss how mental health improvements contribute to cognitive enhancement.\nDeliverables: Add a section to the annotated bibliography summarizing these findings.\nWeek 11: Experiment Data Collection and Analysis\nObjective: Conduct the main experiment and analyze data.\nActivities:\n- Execute the full-scale experiment as designed.\n- Begin preliminary data analysis using appropriate statistical methods.\nDeliverables: Submit a preliminary data analysis report.\nWeek 12: Second Presentation on Experimental Findings\nObjective: Present initial findings from the experiment.\nActivities:\n- Prepare a presentation discussing the experimental design, data collection, and initial results.\n- Engage in a critical discussion of the findings.\nDeliverables: Deliver the presentation and submit the slides.\nWeek 13: Further Data Analysis and Interpretation\nObjective: Complete data analysis and begin interpreting results.\nActivities:\n- Continue with more advanced statistical analysis.\n- Start drafting the discussion section for the final report.\nDeliverables: Submit a detailed data analysis report.\nWeek 14: Peer Review and Feedback Session\nObjective: Obtain peer feedback on the research project.\nActivities:\n- Share drafts of the final report and discussion with peers.\n- Provide and receive constructive feedback.\nDeliverables: Revise the report based on peer feedback.\nWeek 15: Final Literature Review and Integration\nObjective: Integrate new findings into the overall understanding of the topic.\nActivities:\n- Update and finalize the annotated bibliography with recent literature.\n- Reflect on how the experimental findings fit within the broader research context.\nDeliverables: Submit the final annotated bibliography.\nWeek 16: Final Presentation of Research Findings\nObjective: Present comprehensive research findings.\nActivities:\n- Deliver a final presentation summarizing the entire research project.\n- Discuss implications, limitations, and potential future research.\nDeliverables: Deliver the final presentation and submit the completed research report.\nWeek 17: Final Report Submission and Reflection\nObjective: Submit the final research report and reflect on the independent study experience.\nActivities:\n- Finalize and submit the research report, including all sections (introduction, methods, results, discussion, and conclusion).\n- Write a reflective essay on what was learned through the course.\nDeliverables: Submit the final research report and reflective essay.\nWeek 18: Oral Presentation and Course Wrap-Up\nObjective: Present research findings orally and discuss the overall course experience.\nActivities:\n- Deliver an oral presentation of research findings to peers and the instructor.\n- Participate in a final debriefing session.\n- Discuss potential future research or career paths related to exercise and cognition.\nDeliverables: Deliver the oral presentation and submit a brief outline of future research ideas or career goals"}, "textbook": {"ch": "由教授根據個別學生的研究題目指定閱讀材料", "en": "Journal papers and book chapters assigned by the teacher"}, "selfCompiledRate": {"ch": "60", "en": "60"}, "instructMethod": {"ch": "講授\n\n\n個別指導", "en": ["Lecture", "", "", "Individual Instruction"]}, "gradMethod": {"ch": "出席及參與 40％\n研究計劃執行 30％\n期末報告 30％", "en": "Attendance ＆ participation in the class 40％\nQuality of conducting research project 30％\nFinal report 30％"}, "officeHour": {"ch": "週一12-1PM 或另約時間", "en": "Mondays 12-1PM or by appointment"}, "teachWeeks": {"ch": "18", "en": "18"}, "flexDiscription": {"ch": "", "en": ""}, "domain": {"ch": "基礎認知神經科學理論\n\n\n、\n\n\n認知實驗方法學\n\n\n、\n\n\n知覺與行動", "en": "基礎認知神經科學理論\n\n\n、\n\n\n認知實驗方法學\n\n\n、\n\n\n知覺與行動"}, "map": {"ch": [{"competencies": "整合專業知能", "rating": "(4)高", "assesments": ["實作/實驗"]}, {"competencies": "獨立設計與執行研究計畫", "rating": "(5)非常高", "assesments": ["口頭報告/口試", "專題研究報告(書面)"]}, {"competencies": "精熟及整合研究工具", "rating": "(4)高", "assesments": ["實作/實驗"]}, {"competencies": "研究倫理", "rating": "(3)普通", "assesments": ["口頭報告/口試", "專題研究報告(書面)", "實作/實驗"]}, {"competencies": "溝通、表達與團隊合作能力", "rating": "(1)非常低", "assesments": ["口頭報告/口試"]}], "en": [{"competencies": "Integral professional knowledge and skills", "rating": "(4)High", "assesments": ["Practices/Experiments"]}, {"competencies": "Independently design and execute research projects", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam", "Research Report(printed on paper)"]}, {"competencies": "Proficiency and intergration of research tools in Cognitive Neuroscience", "rating": "(4)High", "assesments": ["Practices/Experiments"]}, {"competencies": "Research Ethics", "rating": "(3)Medium", "assesments": ["Presentation/Oral Exam", "Research Report(printed on paper)", "Practices/Experiments"]}, {"competencies": "Communication Skills", "rating": "(1)VeryLow", "assesments": ["Presentation/Oral Exam"]}]}, "assignCriteria": {"ch": ["系所:限認知神經科學研究所碩士班、認知神經科學研究所博士班、跨領域神經科學博士學位學程(台灣聯合大學系統)、跨領域神經科學國際研究生博士學位學程。"], "en": ["Department:Graduate Institute of Cognitive Neuroscience、Graduate Institute of Cognitive Neuroscience、International Ph.D. program in Interdisciplinary neuroscience (University System of Taiwan)、International Ph.D. Program in Interdisciplinary Neuroscience only."]}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 1}, "stuGrade": {"doctor": {}, "master": {"2": 1}, "bachelor": {}}, "stus": [{"serial": "1", "stunum": "11*******", "department": "認知神經科學研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "2", "stunum": "11*******", "department": "跨領域神經科學國際研究生博士學位學程", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}]}