{"serial": "42015", "department_serial": 48, "code": "MB5063", "class": "*", "name": {"en": "Social and Sustainable Entrepreneurship", "ch": "社會與永續創業"}, "notice": {"en": "[Course Cancelled]", "ch": "[已停開]"}, "instructor": {"en": ["Shen, Chien-wen"], "ch": ["沈建文"]}, "credits": 3, "time_loc": [{"time": {"week": 3, "session": ["5", "6", "7"]}, "loc": {"building": "I1", "room": "002"}}], "isRequired": false, "isFullSem": false, "MaxStu": -1, "department": {"ch": "國際經營管理碩士學位學程", "en": "International Master of Business Administration program"}, "system": {"ch": "碩士班", "en": "Master Programs"}, "language": {"ch": "英語", "en": "English"}, "card": {"ch": "部份使用", "en": "Optional"}, "assigned": 0, "selected": 0, "remark": {"ch": "與SL5003合班授課", "en": ""}, "goal": {"ch": "本課程的目標是引導學生建立社會與永續創業的案例研究，並透過案例學習，特別著重亞洲地區的案例。透過這個過程，學生將深入了解該地區的獨特挑戰和機會，並將理論知識應用於實際情境中。課程旨在提升學生評估並制定平衡經濟、社會和環境目標的創業策略的能力。", "en": "The goal of this course is to guide students in building and analyzing case studies on social and sustainable entrepreneurship, with a particular emphasis on examples from Asia. Through this process, students will develop a deep understanding of the unique challenges and opportunities in the region, applying theoretical knowledge to real-world scenarios. The course aims to enhance students‘ ability to critically assess and develop entrepreneurial strategies that balance economic, social, and environmental goals."}, "outline": {"ch": "Teaching Content The course begins with an introduction to the fundamentals of social and sustainable entrepreneurship, covering key concepts, the global landscape, and the unique challenges faced in this field. It then explores various case studies, allowing students to analyze real-world examples and learn effective strategies for social impact. The course guides students through the process of writing their own case studies, focusing on developing strong research skills and presenting findings on specific topics. Emphasis is placed on the unique context of Asia, with multiple weeks dedicated to examining social and sustainable entrepreneurship within the region. Students present their case study findings in several sessions, allowing for peer review and collaborative learning. The course concludes with final presentations, enabling students to showcase their comprehensive understanding and practical insights gained throughout the course.本課程首先介紹社會與永續創業的基本概念，涵蓋關鍵概念、全球趨勢及在此領域所面臨的獨特挑戰，接著透過各種案例研究，讓學生分析真實世界的案例並學習有效的社會影響策略。課程將引導學生撰寫自己的案例研究，著重於培養研究技能及呈現特定主題的研究結果。課程特別著重亞洲的獨特情境，並用數週時間深入探討亞洲地區的社會與永續創業。學生將在多次報告中展示他們的案例研究成果，進行同儕評審及協同學習。課程最後將以期末報告作為結尾，使學生能夠展現其整體理解及在課程中所獲得的實務見解。", "en": "The course begins with an introduction to the fundamentals of social and sustainable entrepreneurship, covering key concepts, the global landscape, and the unique challenges faced in this field. It then explores various case studies, allowing students to analyze real-world examples and learn effective strategies for social impact. The course guides students through the process of writing their own case studies, focusing on developing strong research skills and presenting findings on specific topics. Emphasis is placed on the unique context of Asia, with multiple weeks dedicated to examining social and sustainable entrepreneurship within the region. Students present their case study findings in several sessions, allowing for peer review and collaborative learning. The course concludes with final presentations, enabling students to showcase their comprehensive understanding and practical insights gained throughout the course."}, "textbook": {"ch": "Information Resources Management Association (Ed.). (2022). Research anthology on approaches to social and sustainable entrepreneurship. IGI Global.", "en": "Information Resources Management Association (Ed.). (2022). Research anthology on approaches to social and sustainable entrepreneurship. IGI Global."}, "selfCompiledRate": {"ch": "0", "en": "0"}, "instructMethod": {"ch": "講授", "en": ["Lecture"]}, "gradMethod": {"ch": "Class Participation 30％\nPaper/Theses Writing 50％\nPresentation 20％", "en": "Class Participation 30％\nPaper/Theses Writing 50％\nPresentation 20％"}, "officeHour": {"ch": "13:00-14:00 Monday", "en": "13:00-14:00 Monday"}, "teachWeeks": {"ch": "16+2", "en": "16+2"}, "flexDiscription": {"ch": "N/A", "en": "N/A"}, "domain": {"ch": "永續發展", "en": "永續發展"}, "map": {"ch": [{"competencies": "管理知識", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "獨立思考和解決問題能力", "rating": "(4)高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "國際觀", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "社會責任", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}, {"competencies": "溝通能力", "rating": "(5)非常高", "assesments": ["紙筆測驗/會考", "口頭報告/口試"]}], "en": [{"competencies": "Management Knowledge", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "Critical Thinking and Problem-solving", "rating": "(4)High", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "Global Perspective", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "Social Responsibility", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}, {"competencies": "Communication Skill", "rating": "(5)VeryHigh", "assesments": ["Test/Exam", "Presentation/Oral Exam"]}]}, "assignCriteria": {"ch": ["系所:限國際經營管理碩士學位學程。"], "en": ["Department:International Master of Business Administration program only."]}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 0}, "stuGrade": {"doctor": {}, "master": {}, "bachelor": {}}, "stus": []}