{"serial": "33053", "code": "ME4110", "class": "*", "name": {"en": "Seminar on Mechanical Engineering and Professional", "ch": "工程講座與專業倫理"}, "instructor": {"en": "Yang-Yi,Zheng", "ch": "鄭揚宜"}, "department": {"en": "Department of Mechanical Engineering", "ch": "機械工程學系"}, "system": {"en": "Undergraduate Programme", "ch": "學士班"}, "time_loc": {"en": [{"time": {"week": 3, "period": ["5"]}, "loc": "Mechatronics Laboratory 452"}, {"time": {"week": 3, "period": ["6"]}, "loc": "Mechatronics Laboratory 452"}], "ch": [{"time": {"week": 3, "period": ["5"]}, "loc": "機電實驗室", "room": "452"}, {"time": {"week": 3, "period": ["6"]}, "loc": "機電實驗室", "room": "452"}]}, "required": false, "credits": "2", "isFulSem": false, "lang": {"en": "Chinese", "ch": "國語"}, "crsCard": {"en": "Optional", "ch": "部份使用"}, "max_stu": 50, "assigned": 0, "selected": 47, "remark": {"en": "", "ch": ""}, "goal": {"en": "Mechanical engineering is the mother of all engineering disciplines, essential for any industry to fully achieve its potential. However, the ever-evolving field of machinery and engineering, while driving societal progress, has also sparked at least two significant areas worthy of discussion: professional ethics and social innovation. Firstly, ethics isn‘t merely a matter of right or wrong; it encompasses the interactions between individuals, communities, and the environment. These multi-layered, multifaceted relationships evolve continuously with history and technological advancements. From various professional perspectives, ethics aids in navigating complex technological and societal issues. Looking at societal development allows examination of how technological advancements like machinery and engineering reshape human life and bring about behavioral and conceptual changes. For instance, artificial intelligence significantly impacts critical values like privacy rights, prompting profound ethical contemplation. Continuing from the previous point, the evolution of society is intricately linked with technological advancements. The fields of machinery and engineering not only form the bedrock of industrial development but also serve as arenas to cultivate professional ethics and social responsibility through observing interactions between individuals, communities, and the environment. They also present opportunities to merge career development with social innovation. This course aims to broaden students‘ understanding of the applications and research scope of mechanical engineering, the current status of industrial development, and the development and training of professionals. It specifically aims to achieve three key objectives: 1. Understanding the relationship between engineering evolution and societal development. 2. Comprehending the background and prospects of professional ethics. 3. Grasping the ethics of emerging engineering technologies like artificial intelligence.", "ch": "機械為工程之母，任何工程與產業都需要機械設備方能克盡其功。然而日新月異的機械與工程雖然帶動了社會發展，卻也引發了至少兩個值得討論的問題意識：專業倫理與社會創新。 首先，倫理並不僅是道德對錯的規範問題，而是人我、群體與環境之間的互動關係，這些多層次、多面向的關係會隨著歷史演進與科技研發而不斷變動。從各個專業領域來看，倫理有助於我們在複雜的科技與社會問題之間做出思考；從社會發展的角度而言，則可以檢視機械與工程等科技研發，如何開拓人類生活空間並帶來行為與觀念變革，以人工智慧為例，即影響了隱私權等重要價值思辨。其次，延續前一部份的思考，社會的演進與科技研發息息相關，機械與工程領域不僅是產業發展的基礎，更可以在觀察人我、群體與環境的互動當中培養專業倫理與社會責任素養，同時在其中尋求結合生涯發展與社會創新的契機。 本課程將增加修課同學對於機械工程應用與研究範疇、產業發展現狀以及從業人員養成與訓練等方面的了解，並具體達成以下三點目標： 1.能夠了解工程演變與社會發展的關係 2.能夠了解專業倫理的背景與展望 3.能夠了解人工智慧等新興工程科技倫理"}, "content": {"en": "In today‘s rapidly advancing technological society, the swift development of engineering technologies such as artificial intelligence has driven the trend of industrial IoT (Internet of Things). This trend not only shifts from precision manufacturing towards smart manufacturing but also triggers various challenges such as environmental impacts, intellectual property, and privacy concerns. However, the ethical grey areas arising from the development of technologies like artificial intelligence can, through discussion and deliberation, strike a better balance between social responsibility and nurturing an innovative spirit.\nBy employing the following three teaching methods, this course aims to effectively achieve its instructional objectives:\n1. Field Insights into Mechanical Engineering Applications: Inviting outstanding alumni and industry experts for discussions, sharing experiences, and organizing visits to companies to explore practical applications.\n2. Exploration of the Current State of Mechanical Engineering Research and Development: Arranging talks by department professors and visits to laboratories to delve into ongoing research and development.\n3. Professional Ethics Discussions and Critical Thinking: Engaging in discussions on various professional ethics topics and encouraging students to debate and engage in creative thinking exercises.", "ch": "在科技日新月異的當代社會，由人工智慧等工程科技的快速研發，帶動了工業物聯網的發展趨勢，不僅由精密製造導向智慧製造，也引發許多例如環境衝擊、智慧財產、隱私權等相應的挑戰。然而，由人工智慧等科技發展所帶來的倫理模糊地帶，經過討論與論證，正可以更加兼顧社會責任及培養創新精神。透過以下三種授課模式，將能有效落實本課程欲達到之教學目標：\n1.機械工程應用領域分享：邀請業界傑出系友及專家座談，除分享經驗之外亦進行企業參訪。\n2.機械工程研發狀況探究：邀請系上教授座談及參訪實驗室。\n3.專業倫理討論及思辨：針對不同專業倫理議題進行討論，同學進行論證及創意思考。"}, "textbook": {"en": "Johnson, Deborah G. (2020). Engineering Ethics: Contemporary and Enduring Debates. Yale University Press Dubber, Markus. et al. (2021). Oxford Handbook of Ethics in AI. Oxford University Press", "ch": "無"}, "self_comp": {"en": "50", "ch": "50"}, "method": {"en": "Lecture Seminar Others", "ch": "講授 研討 其他"}, "grading": {"en": "Class performance: 20; final test: 25; group discussion: 25; final project: 30", "ch": "課堂表現20％、期末測驗25％、小組討論25％、期末專題30％"}, "office_hr": {"en": "Make an additional appointment with the teacher.", "ch": "與教師另外預約"}, "teach_week": {"en": "16+2", "ch": "16+2"}, "flex_desc": {"en": "flexible learning", "ch": "彈性學習"}, "domain": {"en": "基礎學科 、 其他選修課", "ch": "基礎學科 、 其他選修課"}, "map": {"en": [{"competency": "Engineering Knowledge and Problem Analysis", "rate": "(4) High", "Assessments": "Test/Exam ， Presentation/Oral Exam ， Research Report(printed on paper)"}, {"competency": "Experiment and Implementation", "rate": "(3) Medium", "Assessments": "Test/Exam ， Presentation/Oral Exam ， Research Report(printed on paper)"}, {"competency": "Design / Development of Solution and Investigation", "rate": "(3) Medium", "Assessments": "Test/Exam ， Presentation/Oral Exam ， Research Report(printed on paper)"}, {"competency": "Communication and Team Work", "rate": "(4) High", "Assessments": "Test/Exam ， Presentation/Oral Exam ， Research Report(printed on paper)"}, {"competency": "The Engineer and Society", "rate": "(5) Very High", "Assessments": "Test/Exam ， Presentation/Oral Exam ， Research Report(printed on paper)"}], "ch": [{"competency": "專業知識與技能", "rate": "(4) 高", "Assessments": "紙筆測驗/會考 ， 口頭報告/口試 ， 專題研究報告(書面)"}, {"competency": "實驗規劃與資料分析", "rate": "(3) 普通", "Assessments": "紙筆測驗/會考 ， 口頭報告/口試 ， 專題研究報告(書面)"}, {"competency": "工程設計與整合", "rate": "(3) 普通", "Assessments": "紙筆測驗/會考 ， 口頭報告/口試 ， 專題研究報告(書面)"}, {"competency": "合作溝通與管理", "rate": "(4) 高", "Assessments": "紙筆測驗/會考 ， 口頭報告/口試 ， 專題研究報告(書面)"}, {"competency": "專業倫理與社會責任", "rate": "(5) 非常高", "Assessments": "紙筆測驗/會考 ， 口頭報告/口試 ， 專題研究報告(書面)"}]}, "asign_crite": {"en": ["Department:Department of Mechanical Engineering only.Year:Fourth Year only.", "Department:Department of Mechanical Engineering only.Year:Third Year only.", "Department:Interdisciplinary Program of Engineering only."], "ch": ["系所:限機械工程學系。年級:限四年級。", "系所:限機械工程學系。年級:限三年級。", "系所:限工學院學士班。"]}, "prelim_sel": 47, "gender": {"male": 36, "female": 11}, "stu_depart": {"en": {"Design and Analysis Engineering Program , Department of Mechanical Engineering": 26, "Advanced Materials and Manufacturing  Program , Department of Mechanical Engineering": 3, "Opto-Mechatronics Engineering Program , Department of Mechanical Engineering": 11, "Interdisciplinary Program of Engineering": 7}, "ch": {"機械工程學系設計與分析組": 26, "機械工程學系先進材料與精密製造": 3, "機械工程學系光機電工程組": 11, "工學院學士班": 7}}, "stu_grade": {"Bachelor": {"4": 16, "3": 27, "2": 3, "1": 1}, "Master": {}, "Doctor": {}}}