{"serial": "16007", "department_serial": 16, "code": "AR6063", "class": "*", "name": {"en": "Seminar：Contemporary Art in Taiwan", "ch": "台灣當代藝術專題"}, "notice": {"en": "", "ch": "分發條件之外的同學（包括大三、大四同學）欲選修，須先與教師洽談領取密碼卡"}, "instructor": {"en": ["Sheng Hung, Wang"], "ch": ["王聖閎"]}, "credits": 3, "time_loc": [{"time": {"week": 4, "session": ["6", "7", "8"]}, "loc": {"building": "C2", "room": "206"}}], "isRequired": false, "isFullSem": false, "MaxStu": -1, "department": {"ch": "藝術學研究所碩士班", "en": "MA in Art Studies"}, "system": {"ch": "碩士班", "en": "Master Programs"}, "language": {"ch": "國語", "en": "Chinese"}, "card": {"ch": "部份使用", "en": "Optional"}, "assigned": 10, "selected": 0, "remark": {"ch": "分發條件之外的同學（包括大三、大四同學）欲選修，須先與教師洽談領取密碼卡", "en": ""}, "goal": {"ch": "培養學生對臺灣當代藝術前瞻性課題的敏感度及解讀能力，並且對於臺灣在亞洲當代藝術，乃至於國際當代藝術發展中的戰略位置，有較為宏觀而整體的視野。\n\n其次，培養學生對新興的創作實驗暨展演成果的分析寫作能力，以及執行獨立研究、議題開發的能力。\n\n最後，在前述的基礎目標上，進一步帶領學生思考現當代藝術史知識之確立、應用或翻轉，以及展覽史脈絡的建置和梳理。", "en": "Students will develop sensitivity to and the ability to interpret visionary issues in contemporary art in Taiwan, as well as a comprehensive understanding of Taiwan's strategic position in contemporary art in Asia and the world.\n\nSecondly, students will develop the ability to analyze and write about emerging art experiments and exhibitions, as well as the ability to conduct their own research projects.\n\nFinally, on top of the aforementioned basic objectives, students will be led to consider the establishment, application, or transformation of contemporary art historical knowledge, as well as the construction and compilation of the historical contexts of exhibitions."}, "outline": {"ch": "晚近十多年來，台灣當代藝術興起一波透過創作與策展實踐，重新書寫「腳邊的歷史」的明確趨勢。不少藝術家與策展人們紛紛藉由新的創研計畫和展示策略，找尋有別於以往的歷史敘說模式。當代藝術最前沿的戰線，如今成為最熱衷於歷史檔案、影像、文件，乃至於地方知識之考掘的關鍵領域。此一現象固然呼應了當前文化部的「重建臺灣藝術史計畫」，但我們必須審慎地說，其實台灣當代藝術對於自身歷史∕藝術史書寫的重新扣問與探求，遠比國家文化政策或政黨政治的更迭，走得更早也更深刻。\n從「田野調查」四字開始廣受熱議的2012、13年至今，我們正好來到一個合適的時間點，重新檢視人類學知識及其實踐方法不斷轉介至當代藝術領域究竟產生了哪些亟待梳理的新課題？事實上，台灣不少前輩畫家本來就具備踏查地方文史細節，以及向民間藝術擷取養分的傳統。但這個傳統與今天的「田野熱」或「檔案熱」有何異同？其次，歷史書寫的主體性工程固然重要，但是檔案建置的倫理有其複雜性，而地方知識的適切詮釋也必須詳加考慮。這些問題一再敦促我們去思考，當代藝術秉持的田野技藝仍有可能存在空缺，甚至是盲點。\n從上述第一單元鋪陳的問題意識出發，第二單元轉向實踐方法論的批判性考察。確實，當代有越來越多創作者的行動方式，帶有強烈的製圖學（cartography）的意味。他們的創作研究一方面接近地方文史踏查，另一方面也可能跨入地理學、地質學，或者建築學的知識場域。此種跨領域的工作模式至少能上溯至50-60年代歐洲的「情境主義國際」(Situationist International)，以及後來的日常生活批判傳統。但是台灣當代藝術究竟如何走出屬於自己的文化批判之路？如何在探入城市空間或田野山林之時，開發出有別於以往的感覺介面（同時遠離速食化的「體驗經濟」模式），並且重新發明地圖的測繪方式，將會是本單元集中討論的核心主題。\n第三單元則會將焦點轉向歷史敘說動力的另一個切面，探討當代藝術如何「回訪」那些看似不可追憶的已逝歷史或事件。以關鍵概念：「重現行動」（re-enactment）為起點，我們將會梳理國內外的代表性創作或策展實例，看看藝術家和策展人如何創造性地迴返過去，使得今日的觀眾有機會直面他們不曾參與過的歷史「現場」。我們一方面會為「重現行動」梳理適當的理論架構，另一方面也會思考它是否有可能成為展覽史研究的有效方法。就此而言，這個概念並不是耽戀於過去的懷舊行動，而是將藝術史重新恢復為「活物」——活生生的藝術——的實踐策略。\n最後一個單元，我們則會將目光拋向未來。具體而言，是在反思人類文明之存續的情境下，揣想藝術可能連結的未來。因為有越來越多台灣創作者從更宏觀的文化史、技術史或生態史的回顧性視野中，思考人與自然的根本關係。這些作品或展覽往往能夠嫻熟地擷取科幻小說、神話敘事、殖民歷史、地緣政治，乃至於及環境議題的元素，提供豐富而立體的想像空間。但同時也對身為觀眾的我們拋出一項關鍵問題：如果台灣當代藝術開始能以此方式同時面對過去和未來，那麼我們值得擁有一種名之為「島嶼未來主義」的視野嗎？倘若可以，那麼它的具體內涵與早一步登場的「非洲未來主義」（Afrofuturism）或「Asian futurism」有何不同？它會不會重蹈加速度政治的覆轍，淪為科層技術與計畫性經濟對於真實生命的暴力壓制？又或者，它足以提供一點未來曙光，讓過去百年以來，慣常在帝國夾縫之間思考島嶼命運的我們，有機會想像專屬於台灣的「政治—技術—文化主體性」的敘述模式？我們將以這樣的困難主題，本學期的思想旅程作結。\n課程進度表\n週次課程主題\n第一週課程簡介\n第一單元  田野調查十年回顧：感性田野與暗黑人類學\n第二週導論：再探「藝術家作為民族誌者」諸課題\n第三週民俗攝影的凝視與創作者的田野傳統\n第四週反思南方作為方法：大地藝術季與暗黑人類學的空缺\n第五週長程實踐研究與展演的加速主義批判\n第二單元  藝術製圖學與精神地理學批判\n第六週導論：情境主義國際與政治藝術之（誤）用\n第七週文化能否產生行動？從拉丁美洲的「橫向主義」到東亞的城市抗爭戰線\n第八週素描行動、城市速度學及非視覺的地方知識\n第九週裂解的風景：欲力投射與非人行動的測繪\n第三單元  現場性、歷史複訪及重現行動\n第十週導論：當代重現行動的理論關懷、視野及反思\n第十一週藝術家在現場：重現的誘惑與在場的不可能性\n第十二週從身體圖像到身體作為檔案庫：論「Re」的諸種實踐姿態\n第十三週作為展覽史研究取徑的重現行動\n第四單元  殖民現代性與島嶼未來主義\n第十四週導論：島嶼所開啟∕存封的身體動力線\n第十五週加速主義與亞洲未來主義的諸種變形\n第十六週治理性、科技泛靈論與環境殖民主義的待解難題\n第十七週置身緩慢美學與生態美學的交界帶\n第十八週期末綜合討論", "en": "Course Schedule\nWeek 1 Course Introduction\nPart 1: Ten Years of Fieldwork: Sensible Fieldwork and Dark Anthropology\nWeek 2 Introduction: Revisiting the Topics of \"Artist as Ethnographer\"\nWeek 3: The Gaze of Folk Photography and the Field Tradition of Artists\nWeek 4: Rethinking the South as a Method: Land Art Festival and the Gap of Dark Anthropology\nWeek 5: A Critique of Accelerationism in Long-Term Practice Research and Performance\nPart 2: Artistic Cartography and the Critique of Psychogeography\nWeek 6 Introduction: Situationist International and the (Mis)Use of Political Art\nWeek 7: Can Culture Produce Action? From \"horizontalism\" in Latin America to urban resistance fronts in East Asia\nWeek 8: Sketching action, urban velocity, and non-visual knowledge of place\nWeek 9: Fractured Landscapes: Projections of Desire and the Mapping of Impersonal Actions\nPart 3: Presence, Historical Revisiting, and Re-enactment\nWeek 10 Introduction: Theoretical Concern, Vision, and Reflection of Contemporary Re-enactment\nWeek 11 Artist in the Field: The Temptation of Re-enactment and the Impossibility of Presence\nWeek 12 From Body Image to Body as Archive: On the Various Practices of \"Re-\"\nWeek 13: Re-enactment as a Research Approach to Exhibition History\nPart 4 Colonial Modernity and Island Futurism\nWeek 14 Introduction: The Dynamic Line of the Body Opened/Sealed by the Island\nWeek 15: Variations of Accelerationism and Asian Futurism\nWeek 16: Governance, Technological Animism, and Environmental Colonialism's Unresolved Problems\nWeek 17: At the Intersection of Slow Aesthetics and Ecological Aesthetics\nWeek 18 General discussion"}, "textbook": {"ch": "中文書目部分：\n\n高俊宏，《橫斷記：臺灣山林戰爭、帝國與影像》，新北市：遠足文化，2017。\n愛麗絲．約瑟芬（Alice Josephine）等著，黃楷君、蔡耀緯譯，《福爾摩沙．美麗之島：1910-20年代西方人眼中的臺灣》，新北市：遠足文化，2018。\n布魯諾．拉圖（Bruno Latour）著，陳榮泰、伍啟鴻譯，《著陸何處：全球化、不平等與生態鉅變下，政治該何去何從？》，台北：群學，2020。\n安藤丈將著，林彥瑜譯，《新左運動與公民社會：日本六○年代的思想之路》，新北市：左岸文化，2018。\n呂佩怡主編，《台灣當代藝術策展二十年》，台北市：典藏藝術家庭，2015。\n林怡華主編，《「南方以南」展覽群記》，台北市：我親出版，2021。\n姚瑞中，《巨神連線攝影集》，台北市：典藏藝術家庭，2017。\n柄谷行人，林暉鈞譯，《帝國的結構》，台北：心靈工坊，2015。\n________，林暉鈞譯，《移動的批判：康德與馬克思》，台北：心靈工坊，2019。\n若林正丈、吳密察主編，《跨界的台灣史研究──與東亞史交錯》，台北：播種者，2004。\n席德進，《臺灣民間藝術》，台北：雄獅美術，1991。\n張頌仁、陳光興、高士明主編，《後殖民與歷史的詭計：迪佩什‧查卡拉巴提讀本》，上海：上海人民出版社，2012。\n________，《民族主義，真誠與欺騙：阿希斯‧南迪讀本》，上海：上海人民出版社，2012。\n________，《我們的現代性：帕沙‧查特吉讀本》，上海：上海人民出版社，2012。\n蕭阿勤，《重構臺灣：當代民族主義的文化政治》，台北市：聯經出版，2016。\n龔卓軍，《交陪美學論：當代藝術面向近未來神祇》，台北市：大塊文化，2022。", "en": "Abujbara, Juman, Andrew Boyd, Dave O. Mitchell, and Marcel Taminato. Beautiful Rising: Creative Resistance from the Global South. , 2018. Print. \nAgnew, Vanessa, Jonathan Lamb, and Juliane Tomann. The Routledge Handbook of Reenactment Studies: Key Terms in the Field. , 2021. Print. \nAnderson, Reynaldo, and Charles E. Jones. Afrofuturism 2.0: The Rise of Astro-Blackness. , 2017. Internet resource. \nAranda, Julieta, Brian K. Wood, Anton Vidokle, and Antonio Negri. Supercommunity: Diabolical Togetherness Beyond Contemporary Art. , 2017. Print. \nArns, Inke, and Gabriele Horn. History Will Repeat Itself: Strategien Des Reenactment in Der Zeitgenössischen (medien )kunst Und Performance = Strategies of Re-Enactment in Contemporary (media) Art and Performance. Frankfurt am Main: Revolver, 2007. Print. \nCalonje, Teresa. Live Forever: Collecting Live Art. Walther Konig, Koln, 2015. Print. \nCampbell, Bill. Mothership: Tales from Afrofuturism and Beyond. College Park, MD: Rosarium, 2013. Print. \nCarrigy, Megan. The Reenactment in Contemporary Screen Culture: Performance, Meditation, Repetition. , 2021. Print. \nDavida, Dena, Jane Gabriels, Véronique Hudon, and Marc Pronovost. Curating Live Arts: Critical Perspectives, Essays, and Conversations on Theory and Practice. , 2021. Internet resource. \nDemos, T J. Decolonizing Nature: Contemporary Art and the Politics of Ecology. , 2016. Print. \nDixon, Steven, and Barry Smith. Digital Performance: A History of New Media in Theater, Dance, Performance Art and Installation. Cambridge: The MIT Press, 2015. Print. \nGadanho, Pedro. Eco-visionaries: Art, Architecture and New Media After Anthropocene. Berlin: Hatje CantzVerlag GmbH, 2018. Print. \nGlisic, Iva. Futurist Files: Avant-garde, Politics, and Ideology in Russia, 1905-1930. DeKalb: Northern Illinois University press, 2018. Print. \nGoldberg, RoseLee. Performance Now: Live Art for the Twenty-First Century. , 2018. Print. \nLavender, Isiah I. I. I. Afrofuturism Rising: The Literary Prehistory of a Movement. Columbus: The Ohio State University Press, 2019. Print. \nLavender, Isiah, and Lisa Yaszek. Literary Afrofuturism in the Twenty-First Century. Columbus: The Ohio State university press, 2020. Print. \nLütticken, Sven. Life, Once More: Forms of Reenactment in Contemporary Art : January 27 - March 27 2005, Witte De With, Center for Contemporary Art, Rotterdam. Rotterdam: Witte De With Center for Contemporary Art, 2005. Print. \nMaimon, Vered. Contemporary Art, Photography, and the Politics of Citizenship. , 2021. Internet resource. \nMargulies, Ivone. In Person: Reenactment in Postwar and Contemporary Cinema. , 2019. Internet resource. \nMasura, Nadja. Digital Theatre: The Making and Meaning of Live Mediated Performance, Us & Uk 1990-2020. S.l.: PALGRAVE MACMILLAN, 2021. Print. \nOsborne, Peter. Anywhere or Not at All: Philosophy of Contemporary Art. , 2013. Print. \nPovinelli, Elizabeth A. Between Gaia and Ground: Four Axioms of Existence and the Ancestral Catastrophe of Late Liberalism. , 2021. Print. \nPuri, Shalini, and Debra A. Castillo. Theorizing Fieldwork in the Humanities: Methods, Reflections, and Approaches to the Global South. , 2016. Print. \nReinelt, Janelle G, and Joseph R. Roach. Critical Theory and Performance. Ann Arbor: The University of Michigan Press, 2015. Print. \nRoessler, Norman, and Anthony‏ Squiers. Philosophizing Brecht: Critical Readings on Art, Consciousness, Social Theory and Performance. , 2019. Print. \nSalaris, Claudia. Italian Futurism 1909-1944: Reconstructing the Universe. New York: Guggenheim Museum Publications, U.S, 2014. Print. \nSchechner, Richard. Performance Theory. Place of publication not identified: Routledge, 2015. Print. \nSchneider, Rebecca. The Explicit Body in Performance. London: Taylor and Francis, 2013. Internet resource. \nStern, Nathaniel. Interactive Art and Embodiment: The Implicit Body As Performance. , 2013. Internet resource. \nSteyerl, Hito. Duty Free Art: Art in the Age of Planetary Civil War. , 2019. Print. \nTsing, Anna L, Heather A. Swanson, Elaine Gan, and Nils Bubandt. Arts of Living on a Damaged Planet: Ghosts of the Anthropocene : Monsters of the Anthropocene. Minneapolis: University of Minnesota Press, 2017. Print. \nZamalin, Alex. Black Utopia: The History of an Idea from Black Nationalism to Afrofuturism. , 2019. Print."}, "selfCompiledRate": {"ch": "50%", "en": "50%"}, "instructMethod": {"ch": "講授\n研討", "en": ["Lecture", "Seminar"]}, "gradMethod": {"ch": "課程討論及參與度50%，期末報告50%", "en": "Course discussion and participation 50%, term paper 50%"}, "officeHour": {"ch": "週三下午1:30-4:00", "en": "Wednesday 13:30-16:00"}, "teachWeeks": {"ch": "18", "en": "18"}, "flexDiscription": {"ch": "", "en": ""}, "domain": {"ch": "美學與藝術理論\n\n\n、\n\n\n亞洲藝術史", "en": "美學與藝術理論\n\n\n、\n\n\n亞洲藝術史"}, "map": {"ch": [{"competencies": "專業知能", "rating": "(5)非常高", "assesments": ["口頭報告/口試", "專題研究報告(書面)"]}, {"competencies": "邏輯與批判能力", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "語文表達與溝通", "rating": "(4)高", "assesments": ["口頭報告/口試", "出席/課堂表現"]}, {"competencies": "多元與國際視野", "rating": "(5)非常高", "assesments": ["專題研究報告(書面)", "出席/課堂表現"]}, {"competencies": "自主學習", "rating": "(4)高", "assesments": ["口頭報告/口試", "自我評量/同儕互評"]}, {"competencies": "統合與創新能力", "rating": "(4)高", "assesments": ["口頭報告/口試", "專題研究報告(書面)"]}], "en": [{"competencies": "Professional knowledge", "rating": "(5)VeryHigh", "assesments": ["Presentation/Oral Exam", "Research Report(printed on paper)"]}, {"competencies": "Logical and critical ability", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "Ability to communicate clearly", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Attendance/Performance"]}, {"competencies": "A diverse and international vision", "rating": "(5)VeryHigh", "assesments": ["Research Report(printed on paper)", "Attendance/Performance"]}, {"competencies": "Self-initiative in learning", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Self Assessment/ Peer Assessment"]}, {"competencies": "Integrative and innovative capabilities", "rating": "(4)High", "assesments": ["Presentation/Oral Exam", "Research Report(printed on paper)"]}]}, "assignCriteria": {"ch": ["系所:限藝術學研究所碩士班。", "系所:限亞際文化研究國際碩士學位學程。"], "en": ["Department:MA in Art Studies only.", "Department:International Master‘s Program in Inter-Asia Cultural Studies only."]}, "preselecStu": 0, "stuGender": {"male": 0, "Female": 0}, "stuGrade": {"doctor": {}, "master": {}, "bachelor": {}}, "stus": [{"serial": "1", "stunum": "10*******", "department": "英美語文學系", "grade": "4", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "2", "stunum": "11*******", "department": "文學院學士班", "grade": "4", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "3", "stunum": "11*******", "department": "中國文學系", "grade": "3", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "4", "stunum": "11*******", "department": "文學院學士班", "grade": "3", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "5", "stunum": "11*******", "department": "藝術學研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "6", "stunum": "11*******", "department": "藝術學研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "7", "stunum": "11*******", "department": "藝術學研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "8", "stunum": "11*******", "department": "藝術學研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "9", "stunum": "11*******", "department": "藝術學研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "10", "stunum": "11*******", "department": "地球科學學院學士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}]}