{"serial": "74009", "department_serial": 63, "code": "LG5128", "class": "*", "name": {"en": "Seminar on Labor Law and Social Law", "ch": "勞動法與社會法專題研究"}, "notice": {"en": "", "ch": ""}, "instructor": {"en": ["Chiou Guan Chiau"], "ch": ["邱冠喬"]}, "credits": 3, "time_loc": [{"time": {"week": 5, "session": ["2", "3", "4"]}, "loc": {"building": "HK", "room": "103"}}], "isRequired": false, "isFullSem": false, "MaxStu": -1, "department": {"ch": "法律與政府研究所碩士班", "en": "Institute of  Law and Government"}, "system": {"ch": "碩士班", "en": "Master Programs"}, "language": {"ch": "國語", "en": "Chinese"}, "card": {"ch": "不使用", "en": "None"}, "assigned": 0, "selected": 10, "remark": {"ch": "", "en": ""}, "goal": {"ch": "勞社法專題研究旨在提供修課者關於勞動法與社會法體系之認識與深入討論。\n透過文獻導讀，強化學生對於文獻掌握程度並進行「發表」的訓練。\n透過專題報告，學生可以獲得勞社法基本體系概念，並且在撰寫報告時，學習如何撰寫學術論文之能力。\n本課程採取以問題/專案導向之學習方式(PBL)，學生於課堂中除聆聽講授，並須針對特定專案或議題提出課堂報告並參與討論。\n課程最終目標為：修課學生未來不論是在司法實務界或企業工作，都能夠對勞動法令有足夠之掌握。有志報考公職者，將能對應勞工行政之考科，此外，也能夠對勞工相關法令之立法以及行政機關之解釋令有一定認識。", "en": "The Labor and Social Law Seminar aims to provide participants with an understanding of the labor and social law systems, as well as in-depth discussions. Through literature review, it strengthens students‘ grasp of the literature and trains them in “presentation“ skills. Through project reports, students can gain a basic understanding of the labor and social law systems, and learn how to write academic papers during the report writing process. This course adopts a Problem-Based Learning (PBL) approach, where students, in addition to attending lectures, are required to present reports on specific projects or issues and participate in discussions in class. The ultimate goal of the course is: for the students to have a sufficient grasp of labor laws, whether they are working in the judicial practice field or in a corporate setting in the future. Those aspiring to take the civil service examination will be able to correspond to the subjects related to labor administration. In addition, students will also have a solid understanding of the legislation of labor-related laws and the interpretative orders of administrative agencies."}, "outline": {"ch": "第一堂課會與同學充份討論並確認課程進行方式，請勿缺席。\n以下課綱為暫定版本，教師將依照同學需求做適當之調整。\n本學期將以「個別勞動法」作為課程主軸。\nWeek 2~10老師授課為主，同學導讀（計入平時成績）為輔\n自選「勞動基準法實務爭點」中一講內容導讀，以書籍中編排順序作為導讀週次順序。如能結合課綱順序佳。（修課人數若超過9人時，部分週次會排2個人導讀）一篇導讀時間請抓20~30分鐘。\nWeek 11~報告週\n視修課人數決定一週1人報告還是一週2人報告。\n第一週2024-02-23\n1. 課程介紹\n2. 勞動法必備知識之確認\n3. 何謂「勞動關係」？勞動法起源為何？勞動法是公法還是私法？\n第二週2024-03-01\n【勞動法體系、法源】什麼是現代意義的勞動法？勞資雙方利益衝突為何？勞動法體系的二分法vs三分法？如何適用與判斷勞動法法源？\n【勞動契約概論】勞動契約的生命週期分為哪四個階段？雇主的定義為何？勞工的定義為何？外送平台美食外送員到底是不是受僱勞工？勞動契約與僱傭契約有什麼不同？\n第三週2024-03-08\n【定期契約與不定期契約】\n如何區分不定期契約與定期契約？特定性工作超過一年如果沒有核備，效果如何？如果有企業開出一年一聘的法務工作，我該接受嗎？\n【勞動派遣】\n勞動派遣的三方關係為何？勞動派遣會不會產生僱用不安定的結果？在派遣的世界裡，職業災害的保護是否已足夠？勞動基準法新增禁止轉掛規定，轉掛的態樣有哪些？\n第四週2024-03-15\n【離職後競業禁止】\n法院判斷離職後競業禁止約定標準之演進：五標準說(台北地院85勞訴78)、四標準說(台北地院87勞訴90)、三標準說(台北地院88勞簡上14)\nQ：派遣公司與要派公司簽離職後競業禁止是否有效？\nQ：不可歸責於勞工之終止契約，勞工還受離職後競業禁止約定拘束嗎？\n【最低服務年限】\n約定之服務年限究竟多久才適當(限制勞工職業自由之界線)？法院對於最低服務年限之控制標準為何(96台上1396)？合理補償要多少才合理？\n第五週2024-03-22\n【調職】\n遭遇職災後失能的司機被轉調售票是否合法(109台上1398)？降職減少主管津貼是否合法(109台上1520)？工廠遷廠，可是我有65歲母親須照顧難以配合，是否可拒絕調職(107台上388)？雇主把我調動到大陸之後，拒絕承認我是台灣公司的勞工，我該怎麼辦(出向)？該當資遣條件的時候，不論如何我都必須接受不合理的調職嗎(迴避資遣型調職)？\n【試用期間】\n試用期間是否仍適用勞基法解僱事由、預告期間以及資遣費規定？試用期的長短？試用期可不可以延長？\n第六週2024-03-29\n【工資】\nQ1：雇主常常用很多不同名義發放工作的報酬，例如：工作津貼、交通補助、精勤獎金。到底哪一個是工資？\nQ2：加班費的基礎要怎麼計算？\nQ3：颱風假到底該不該給薪？\n第七週2024-04-05\n<補假>兒童節/民族掃墓節同一日\n第八週2024-04-12\n【休假、請假】\n應休未休之特別休假要如何處理，修法前後有不同嗎？特休未休工資是工資性質嗎，要不要列入平均工資中？勞工集體請特別休假怎麼辦(雇主有無時季變更權)？\n第九週2024-04-19\n【資遣】\n單一部門的虧損可不可以進行經濟性解僱？資遣費要怎麼計算？預告期間一定要給嗎？\n第十週2024-04-26\n【懲戒解僱】\n預告期間內發生懲戒解僱事由，效力如何？(EX:工廠裁員通知後，隔天工人憤而毆打雇主)\n第十一週2024-05-03\n學期報告\n第十二週2024-05-10\n學期報告\n第十三週2024-05-17\n學期報告\n第十四週2024-05-24\n學期報告\n第十五週2024-05-31\n學期報告\n第十六週2024-06-07\n學期報告", "en": "The first class will involve a thorough discussion with students to confirm the course progression, so please do not be absent.\nThe syllabus below is a tentative version, and the teacher will make appropriate adjustments according to students‘ needs. This semester will focus on “Individual Labor Law“.\nWeeks 2 to week 10 will primarily consist of lectures by the teacher, supplemented by student-led literature reviews (which will count towards their continuous assessment). Students should choose a topic from “Practical Issues in the Labor Standards Law“ for their literature review, following the order of topics as arranged in the book. It is preferable if the literature review can align with the order of the syllabus. (If the number of students exceeds 9, some weeks may have 2 students presenting.) Each literature review should last 20-30 minutes.\nWeeks 11 to week 16 will be report weeks, with the number of presentations per week determined by the number of students enrolled.\nWeek 1, 2024-02-23\n1. Course Introduction\n2. Confirmation of Essential Knowledge in Labor Law\n3. What is a “labor relationship“? What are the origins of labor law? Is labor law public or private law?\nWeek 2, 2024-03-01\n[Labor Law System, Legal Sources] What constitutes modern labor law? What are the conflicts of interest between labor and capital? Dichotomy vs. trichotomy in labor law system? How to apply and judge the sources of labor law?\n[Overview of Labor Contracts] What are the four stages of the life cycle of a labor contract? What are the definitions of an employer and an employee? Is a food delivery worker for a platform considered an employee? What are the differences between a labor contract and an employment contract?\nWeek 3, 2024-03-08\n[Fixed-term and Non--fixed-term Contracts]\nHow to distinguish between indefinite-term and fixed-term contracts? What are the implications if specific work exceeds one year without registration? Should I accept a legal job offered on a yearly basis?\n[Labor Dispatch]\nWhat is the tripartite relationship in labor dispatch? Does labor dispatch lead to unstable employment outcomes? In the world of dispatching, is protection against occupational accidents sufficient? The Labor Standards Law has added a prohibition against reassignment; what are the patterns of reassignment?\nWeek 4, 2024-03-15\n[Non-compete clause]\nEvolution of the courts‘ criteria for post-employment non-compete agreements: The Five Criteria Decision (Taipei District Court 85 Labor 78), The Four Criteria Decision (Taipei District Court 87 Labor 90), The Three Criteria Decision (Taipei District Court 88 Labor Simplified 14)\nQ: Is a post-employment non-compete agreement signed between a dispatch company and the client company valid?\nQ: If the termination of the contract is not attributable to the employee, is the employee still bound by the post-employment non-compete agreement?\n[Minimum Service Period]\nWhat is an appropriate duration for a service period agreement (limits on occupational freedom of labor)? What are the courts‘ standards for controlling minimum service periods (96 Tai Shang 1396)? How much compensation is considered reasonable?\nWeek 5, 2024-03-22\n[Transfer]\nIs it legal to reassign a driver who is disabled due to a work-related accident to a ticketing position (109 Tai Shang 1398)? Is it legal to demote and reduce the managerial allowance (109 Tai Shang 1520)? The factory is relocating, but I have a 65-year-old mother to care for and cannot comply with the reassignment; can I refuse (107 Tai Shang 388)? After being transferred to China, the employer refuses to acknowledge that I am an employee of the Taiwanese company; what should I do (expatriation)? When it comes to redundancy, must I accept an unreasonable reassignment no matter what (avoidance of redundancy through reassignment)?\n[Probation Period]\nDoes the probation period still apply to the dismissal reasons, notice period, and severance pay regulations under the Labor Standards Act? What is the duration of the probation period? Can the probation period be extended?\nWeek 6, 2024-03-29\n[Wages]\nQ1: Employers often pay remuneration under various names, such as work allowances, transportation subsidies, and diligence bonuses. Which of these is considered a wage?\nQ2: How should overtime pay be calculated?\nQ3: Should pay be provided on typhoon days?\nWeek 7, 2024-04-05\n[off day] Children‘s Day/National Tomb Sweeping Day on the same day\nWeek 8, 2024-04-12\n[Leave and Holiday]\nHow should unutilized special leave be handled, and has there been any change before and after the amendment? Is the wage for unutilized special leave considered a wage, and should it be included in the average wage? What if employees collectively take special leave (does the employer have the right to change the timing)?\nWeek 9, 2024-04-19\n[layoff]\nCan a single department‘s deficit justify economic dismissal? How should severance pay be calculated? Is notice always required?\nWeek 10, 2024-04-26\n[Disciplinary Dismissal]\nWhat is the effect of a cause for disciplinary dismissal occurring during the notice period? (e.g., After being notified of layoffs, a worker assaults the employer the next day)\nWeek 11, 2024-05-03\nSemester Reports\nWeek 12, 2024-05-10\nSemester Reports\nWeek 13, 2024-05-17\nSemester Reports\nWeek 14, 2024-05-24\nSemester Reports\nWeek 15, 2024-05-31\nSemester Reports\nWeek 16, 2024-06-07\nSemester Reports"}, "textbook": {"ch": "勞動基準法實務爭點，臺灣勞動法學會-主編，2022年，元照(導讀)\n勞動基準法釋義 : 施行二十年之回顧與展望，2005年，新學林", "en": "Practical Issues in the Labor Standards Law, edited by the Taiwan Labor Law Association, 2022, Yuan Zhao\nLabor Standards Act Interpretation: A Retrospective and Prospective Look after Twenty Years of Implementation, 2005, Hsin Hsueh Lin"}, "selfCompiledRate": {"ch": "50%", "en": "50%"}, "instructMethod": {"ch": "講授\n研討", "en": ["Lecture", "Seminar"]}, "gradMethod": {"ch": "平時成績50％\n含出席率、上課發言（特別是第十一週之後）、導讀\n\n期末報告50％\n期末繳交之書面報告\n6/15前寄至jamesbond@cycu.edu.tw\n標題必須載明[中央法政所 XXX 勞社法專題研究期末報告]", "en": "Continuous Assessment: 50％\nIncludes attendance, class participation (especially after Week 11), and literature reviews.\n\nFinal Report: 50％\nThe written report(word/pdf) should be submitted by Jun. 15th. (to jamesbond@cycu.edu.tw)"}, "officeHour": {"ch": "Thu.(all day) at Chung Yuan Christian University", "en": "Thu.(all day) at Chung Yuan Christian University"}, "teachWeeks": {"ch": "16+2", "en": "16+2"}, "flexDiscription": {"ch": "6/14 前請利用時間為學期報告做最後修訂\n6/21 屬於自主學習週，請自行閱讀勞動法與社會法期刊，為後續課程做準備", "en": "Please utilize the time before June 14th for the final revisions of your semester report.\nJune 21st is a self-study week; please independently read journals on labor law and social law to prepare for the upcoming classes."}, "domain": {"ch": "法律學類\n\n\n、\n\n\n法政跨領域", "en": "法律學類\n\n\n、\n\n\n法政跨領域"}, "map": {"ch": [{"competencies": "具備法政暨社會素養", "rating": "(5)非常高", "assesments": ["專題研究報告(書面)", "出席/課堂表現"]}, {"competencies": "具備法政專業研究能力", "rating": "(5)非常高", "assesments": ["專題研究報告(書面)", "出席/課堂表現"]}, {"competencies": "具備掌握法政整合與時勢脈動的視野", "rating": "(4)高", "assesments": ["專題研究報告(書面)", "出席/課堂表現"]}, {"competencies": "具備社會人文關懷的精神", "rating": "(4)高", "assesments": ["專題研究報告(書面)", "出席/課堂表現"]}], "en": [{"competencies": "", "rating": "(5)VeryHigh", "assesments": ["Research Report(printed on paper)", "Attendance/Performance"]}, {"competencies": "", "rating": "(5)VeryHigh", "assesments": ["Research Report(printed on paper)", "Attendance/Performance"]}, {"competencies": "", "rating": "(4)High", "assesments": ["Research Report(printed on paper)", "Attendance/Performance"]}, {"competencies": "", "rating": "(4)High", "assesments": ["Research Report(printed on paper)", "Attendance/Performance"]}]}, "assignCriteria": {"ch": [], "en": []}, "preselecStu": 7, "stuGender": {"male": 4, "Female": 6}, "stuGrade": {"doctor": {}, "master": {"2": 6, "1": 4}, "bachelor": {}}, "stus": [{"serial": "1", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "2", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "3", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "4", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "5", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "6", "stunum": "11*******", "department": "法律與政府研究所碩士在職專班", "grade": "2", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "7", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "8", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "9", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": true, "isManuallySelected": false, "isCodeSelected": false}, {"serial": "10", "stunum": "11*******", "department": "法律與政府研究所碩士班", "grade": "1", "class": "*", "priority": "1", "isRequired": false, "isPreselected": false, "isManuallySelected": false, "isCodeSelected": false}]}